&НаСервере
Функция дм_ПроверитьПозицииВРезерве(ТекТовар, ТекЗаказНаряд)
	ЗапросРезервов = Новый Запрос;
	ЗапросРезервов.Текст = "ВЫБРАТЬ
	                       |	RMS_РезервыПодЗаказНарядОстатки.Номенклатура КАК Номенклатура,
	                       |	RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	                       |	RMS_РезервыПодЗаказНарядОстатки.асЗаказНаряд КАК асЗаказНаряд,
	                       |	RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток КАК КоличествоОстаток
	                       |ИЗ
	                       |	РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
	                       |			&ТекДата,
	                       |			Номенклатура = &ТекТовар
	                       |				И НЕ асЗаказНаряд = &ТекЗаказНаряд) КАК RMS_РезервыПодЗаказНарядОстатки
	                       |ГДЕ
	                       |	RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток > 0";
	ЗапросРезервов.УстановитьПараметр("ТекДата", ТекущаяДата());
	ЗапросРезервов.УстановитьПараметр("ТекТовар", ТекТовар);
	ЗапросРезервов.УстановитьПараметр("ТекЗаказНаряд", ТекЗаказНаряд);
	РезультатРезервов = ЗапросРезервов.Выполнить();
	ВыборкаРезервов = РезультатРезервов.Выбрать();
	Если ВыборкаРезервов.Количество() > 0 Тогда
		МассивСтруктур = Новый Массив;
		Пока ВыборкаРезервов.Следующий() Цикл
			МассивСтруктур.Добавить(Новый Структура("Товар, ЗаказНаряд", ВыборкаРезервов.Номенклатура, ВыборкаРезервов.асЗаказНаряд));
		КонецЦикла;
		Возврат МассивСтруктур;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

