&НаСервере
Процедура ЗаказатьДавСырьеМассово(ИмяТабличнойЧасти)
	
	// +++ Инфостарт 29.12.2021 Настройка доступности кнопки заказа сырья
	Если Объект.Состояние = Перечисления.асСостоянияЗаказНаряда.Заявка
			ИЛИ Объект.Состояние = Перечисления.асСостоянияЗаказНаряда.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'По заявкам не выполняется массовая закупка'"));
		Возврат;
	КонецЕсли;
	// --- Инфостарт 29.12.2021
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Чтобы заказать номенклатуру необходимо записать заказ-наряд!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	// +++ Инфостарт #2507 03.09.2021 Расчет количества по резервам, которого не хватает на складе
	// +++ Инфостарт 01.12.2021 Проведение обязательно
	//Если Модифицированность ИЛИ НЕ Объект.Проведен Тогда
	// --- Инфостарт 01.12.2021
		
		ДокументЗаписан = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Если НЕ ДокументЗаписан Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось провести документ. Заказ не выполнен'"));
			Возврат;
			
		Иначе
			
			ПолеЗН = Новый ПолеКомпоновкиДанных("ЗаказНаряд");
			
			Для Каждого ЭлементОтбора Из ЗакупкиЗапчастей.Отбор.Элементы Цикл
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ЭлементОтбора.ЛевоеЗначение = ПолеЗН Тогда
					ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
				КонецЕсли;
			КонецЦикла;
			
			Если ИмяТабличнойЧасти = "МатериалыЗаказчика" Тогда
				Элементы.ЗакупкиЗапчастей1.Обновить();
			Иначе
				Элементы.ЗакупкиЗапчастей.Обновить();
			КонецЕсли;
			
		КонецЕсли;
		
	// +++ Инфостарт 01.12.2021 Проведение обязательно
	//КонецЕсли;
	// --- Инфостарт 01.12.2021
	
	// +++ Инфостарт #5117 21.10.2021 Учет перемещенных в ремонт и возвращенных из ремонта запчастей
	ТоварыСВозвратом = Новый ТаблицаЗначений;
	ТоварыСВозвратом.Колонки.Добавить("Номенклатура",          Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыСВозвратом.Колонки.Добавить("Характеристика",        Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТоварыСВозвратом.Колонки.Добавить("КоличествоПеремещение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТоварыСВозвратом.Колонки.Добавить("КоличествоВозврат",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	
	// Получение массива давальческих складов
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст =
	"ВЫБРАТЬ
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья КАК Склад
	|ИЗ
	|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
	|
	|СГРУППИРОВАТЬ ПО
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья";
	
	РезультатЗапросаСклада = ЗапросСклада.Выполнить();
	ВыборкаСкладов = РезультатЗапросаСклада.Выбрать();
	
	МассивСкладов = Новый Массив;
	
	Пока ВыборкаСкладов.Следующий() Цикл
		МассивСкладов.Добавить(ВыборкаСкладов.Склад);
	КонецЦикла;
	
	// Получение данных по перемещениям, возвратам и их резервам
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница В (&МассивСкладов)
		|			ТОГДА ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.структурныеЕдиницы.ПустаяСсылка)
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТТоварыВПеремещениях
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование = &ЗаказНаряд
		|	И ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА
		|	И ПеремещениеЗапасовЗапасы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПеремещениеЗапасовЗапасы.Ссылка.дмОтгрузкаНаСобственныеСклады = ЛОЖЬ
		|	И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.асПередачаВРемонт)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница В (&МассивСкладов)
		|			ТОГДА ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.структурныеЕдиницы.ПустаяСсылка)
		|	КОНЕЦ,
		|	ПеремещениеЗапасовЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТТоварыВПеремещенияхВозврат
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование = &ЗаказНаряд
		|			ИЛИ ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование В
		|				(ВЫБРАТЬ
		|					ВТТоварыВПеремещениях.Ссылка
		|				ИЗ
		|					ВТТоварыВПеремещениях КАК ВТТоварыВПеремещениях))
		|	И ПеремещениеЗапасовЗапасы.Ссылка.Проведен = ИСТИНА
		|	И ПеремещениеЗапасовЗапасы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПеремещениеЗапасовЗапасы.Ссылка.дмОтгрузкаНаСобственныеСклады = ЛОЖЬ
		|	И ПеремещениеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.асВозвратИзРемонта)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ПеремещениеЗапасовЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыВПеремещениях.Номенклатура КАК Номенклатура,
		|	ВТТоварыВПеремещениях.Характеристика КАК Характеристика,
		// +++ Инфостарт 19.11.2021 Подсчет количества документов
		|	ВТТоварыВПеремещениях.Ссылка КАК СсылкаПеремещение,
		// --- Инфостарт 19.11.2021
		|	ВТТоварыВПеремещениях.Количество КАК КоличествоПеремещение,
		|	0 КАК КоличествоВозврат
		|ПОМЕСТИТЬ ВТТоварыВПеремещенияхСВозвратом
		|ИЗ
		|	ВТТоварыВПеремещениях КАК ВТТоварыВПеремещениях
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТТоварыВПеремещенияхВозврат.Номенклатура,
		|	ВТТоварыВПеремещенияхВозврат.Характеристика,
		// +++ Инфостарт 19.11.2021 Подсчет количества документов
		|	ЗНАЧЕНИЕ(Документ.ПеремещениеЗапасов.ПустаяСсылка),
		// --- Инфостарт 19.11.2021
		|	0,
		|	ВТТоварыВПеремещенияхВозврат.Количество
		|ИЗ
		|	ВТТоварыВПеремещенияхВозврат КАК ВТТоварыВПеремещенияхВозврат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыВПеремещенияхСВозвратом.Номенклатура КАК Номенклатура,
		|	ВТТоварыВПеремещенияхСВозвратом.Характеристика КАК Характеристика,
		// +++ Инфостарт 19.11.2021 Подсчет количества документов
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТТоварыВПеремещенияхСВозвратом.СсылкаПеремещение) КАК ДокументыПеремещений,
		// --- Инфостарт 19.11.2021
		|	СУММА(ВТТоварыВПеремещенияхСВозвратом.КоличествоПеремещение) КАК КоличествоПеремещение,
		|	СУММА(ВТТоварыВПеремещенияхСВозвратом.КоличествоВозврат) КАК КоличествоВозврат
		|ИЗ
		|	ВТТоварыВПеремещенияхСВозвратом КАК ВТТоварыВПеремещенияхСВозвратом
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТТоварыВПеремещенияхСВозвратом.Номенклатура,
		|	ВТТоварыВПеремещенияхСВозвратом.Характеристика
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВТТоварыВПеремещенияхСВозвратом.КоличествоПеремещение) > 0
		|		ИЛИ СУММА(ВТТоварыВПеремещенияхСВозвратом.КоличествоВозврат) > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТоварыВПеремещениях.Ссылка КАК ДокументПеремещения,
		|	ВТТоварыВПеремещениях.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТТоварыВПеремещениях.Номенклатура КАК Номенклатура,
		|	ВТТоварыВПеремещениях.Характеристика КАК Характеристика,
		|	ВТТоварыВПеремещениях.Количество КАК КоличествоВПеремещении,
		|	-1 * ЕСТЬNULL(RMS_РезервыПодЗаказНарядОбороты.КоличествоОборот, 0) КАК КоличествоСписано
		|ИЗ
		|	ВТТоварыВПеремещениях КАК ВТТоварыВПеремещениях
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				асЗаказНаряд = &ЗаказНаряд
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТТоварыВПеремещениях.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТТоварыВПеремещениях КАК ВТТоварыВПеремещениях)) КАК RMS_РезервыПодЗаказНарядОбороты
		|		ПО ВТТоварыВПеремещениях.Ссылка = RMS_РезервыПодЗаказНарядОбороты.Регистратор
		|			И ВТТоварыВПеремещениях.Номенклатура = RMS_РезервыПодЗаказНарядОбороты.Номенклатура
		|			И ВТТоварыВПеремещениях.Характеристика = RMS_РезервыПодЗаказНарядОбороты.Характеристика
		|			И ВТТоварыВПеремещениях.СтруктурнаяЕдиница = RMS_РезервыПодЗаказНарядОбороты.СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("ЗаказНаряд",    Объект.Ссылка);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	// +++ Инфостарт 23.11.2021 Подсчет количества документов
	МассивПропуска = Новый Массив;
	// --- Инфостарт 23.11.2021
	
	// +++ Инфостарт 28.12.2021 Добавление товаров без резерва и перемещения
	ТоварыВПеремещениях = Новый Массив;
	// --- Инфостарт 28.12.2021
	
	// Выполнение сравнения в зависимости от наличия возврата по перемещению
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаВозврата    = РезультатЗапроса[3].Выбрать();
	ТаблицаПеремещения = РезультатЗапроса[4].Выгрузить();
	
	Пока ВыборкаВозврата.Следующий() Цикл
		Если ВыборкаВозврата.КоличествоВозврат = 0 Тогда
			
			// +++ Инфостарт 19.11.2021 Добавление аналогов
			Если ВыборкаВозврата.Номенклатура.дмЭтоАналог Тогда
				
				СтрокаВозврата = ТоварыСВозвратом.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаВозврата);
				Продолжить;
				
			КонецЕсли;
			// --- Инфостарт 19.11.2021
			
			// +++ Инфостарт 28.12.2021 Добавление товаров без резерва и перемещения
			ТоварыВПеремещениях.Добавить(ВыборкаВозврата.Номенклатура);
			// --- Инфостарт 28.12.2021
			
			// Создание движения расхода резерва по перемещению, у которых ранее оно не было создано
			ОтборПеремещений = Новый Структура();
			ОтборПеремещений.Вставить("Номенклатура",   ВыборкаВозврата.Номенклатура);
			ОтборПеремещений.Вставить("Характеристика", ВыборкаВозврата.Характеристика);
			
			СтрокиСПеремещением = ТаблицаПеремещения.НайтиСтроки(ОтборПеремещений);
			
			Для каждого СтрокаСПеремещением Из СтрокиСПеремещением Цикл
				
				РазницаКоличества = СтрокаСПеремещением.КоличествоВПеремещении - СтрокаСПеремещением.КоличествоСписано;
				
				Если РазницаКоличества <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НаборЗаписейРезервов = РегистрыНакопления.RMS_РезервыПодЗаказНаряд.СоздатьНаборЗаписей();
				НаборЗаписейРезервов.Отбор.Регистратор.Установить(СтрокаСПеремещением.ДокументПеремещения);
				НаборЗаписейРезервов.Прочитать();
				
				НоваяЗапись = НаборЗаписейРезервов.Добавить();
				НоваяЗапись.ВидДвижения        = ВидДвиженияНакопления.Расход;
				НоваяЗапись.Активность         = Истина;
				НоваяЗапись.Период             = СтрокаСПеремещением.ДокументПеремещения.Дата;
				НоваяЗапись.асЗаказНаряд       = Объект.Ссылка;
				НоваяЗапись.Организация        = СтрокаСПеремещением.ДокументПеремещения.Организация;
				НоваяЗапись.СтруктурнаяЕдиница = СтрокаСПеремещением.СтруктурнаяЕдиница;
				НоваяЗапись.Номенклатура       = СтрокаСПеремещением.Номенклатура;
				НоваяЗапись.Характеристика     = СтрокаСПеремещением.Характеристика;
				НоваяЗапись.Количество         = РазницаКоличества;
				
				НаборЗаписейРезервов.Записать();
				
			КонецЦикла;
			
		// +++ Инфостарт 23.11.2021 Подсчет количества документов
		ИначеЕсли ВыборкаВозврата.КоличествоВозврат <> 0 И ВыборкаВозврата.ДокументыПеремещений > 2
					И ВыборкаВозврата.КоличествоПеремещение > ВыборкаВозврата.КоличествоВозврат Тогда
			
			МассивПропуска.Добавить(ВыборкаВозврата.Номенклатура);
			Продолжить;
		// --- Инфостарт 23.11.2021
			
		Иначе
			
			СтрокаВозврата = ТоварыСВозвратом.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаВозврата);
			
		КонецЕсли;
	КонецЦикла;
	// --- Инфостарт #5117 21.10.2021
	
	ЗаполнитьДанныеПоОстаткамНаСкладеХранения();
	// --- Инфостарт #2507 03.09.2021
	
	// Получение всех материалов, по которым не хватает остатка на складах с распределением с учетом резервов
	// Также учитываются ранее выполненные закупки по данному документу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		// +++ Инфостарт #2507 03.09.2021 Изменение алгоритма. Поочередный расчет недостатка в резервах выполнен ранее
		//"ВЫБРАТЬ
		//|	МатериалыЗаказчика.Номенклатура КАК Номенклатура,
		//|	МатериалыЗаказчика.Характеристика КАК Характеристика,
		//|	МатериалыЗаказчика.Количество КАК Количество
		//|ПОМЕСТИТЬ ВТ_МатериалыЗаказчика
		//|ИЗ
		//|	&МатериалыЗаказчика КАК МатериалыЗаказчика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_МатериалыЗаказчика.Номенклатура КАК Номенклатура,
		//|	ВТ_МатериалыЗаказчика.Характеристика КАК Характеристика,
		//|	СУММА(ВТ_МатериалыЗаказчика.Количество) КАК Количество
		//|ПОМЕСТИТЬ ВТ_МатериалыЗаказчикаГруп
		//|ИЗ
		//|	ВТ_МатериалыЗаказчика КАК ВТ_МатериалыЗаказчика
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_МатериалыЗаказчика.Характеристика,
		//|	ВТ_МатериалыЗаказчика.Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	RMS_РезервыПодЗаказНарядОстатки.Номенклатура КАК Номенклатура,
		//|	RMS_РезервыПодЗаказНарядОстатки.Характеристика КАК Характеристика,
		//|	СУММА(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток) КАК Количество
		//|ПОМЕСТИТЬ ВТ_Резервы
		//|ИЗ
		//|	РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		//|			,
		//|			(Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ_МатериалыЗаказчикаГруп.Номенклатура,
		//|						ВТ_МатериалыЗаказчикаГруп.Характеристика
		//|					ИЗ
		//|						ВТ_МатериалыЗаказчикаГруп КАК ВТ_МатериалыЗаказчикаГруп)
		//|				И Организация = &Организация) КАК RMS_РезервыПодЗаказНарядОстатки
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		//|				ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		//|			ИНАЧЕ RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница
		//|		КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	RMS_РезервыПодЗаказНарядОстатки.Номенклатура,
		//|	RMS_РезервыПодЗаказНарядОстатки.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		//|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
		//|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		//|ПОМЕСТИТЬ ВТ_Остатки
		//|ИЗ
		//|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		//|			,
		//|			(Номенклатура, Характеристика) В
		//|					(ВЫБРАТЬ
		//|						ВТ_МатериалыЗаказчикаГруп.Номенклатура,
		//|						ВТ_МатериалыЗаказчикаГруп.Характеристика
		//|					ИЗ
		//|						ВТ_МатериалыЗаказчикаГруп КАК ВТ_МатериалыЗаказчикаГруп)
		//|				И Организация = &Организация) КАК ЗапасыНаСкладахОстатки
		//|ГДЕ
		//|	ВЫБОР
		//|			КОГДА ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		//|				ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		//|			ИНАЧЕ ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		//|		КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗапасыНаСкладахОстатки.Номенклатура,
		//|	ЗапасыНаСкладахОстатки.Характеристика
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		"ВЫБРАТЬ
		|	РезервыНоменклатуры.асЗаказНаряд КАК асЗаказНаряд,
		|	РезервыНоменклатуры.Номенклатура КАК Номенклатура,
		|	РезервыНоменклатуры.СкладУчета КАК СкладУчета,
		|	РезервыНоменклатуры.РезервТекущегоЗаказНаряда КАК РезервТекущегоЗаказНаряда,
		|	РезервыНоменклатуры.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_РезервыНоменклатуры
		|ИЗ
		|	&РезервыНоменклатуры КАК РезервыНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РезервыНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_РезервыНоменклатуры.Количество) КАК КоличествоНедостаток
		|ПОМЕСТИТЬ ВТ_МатериалыНедостатокГруп
		|ИЗ
		|	ВТ_РезервыНоменклатуры КАК ВТ_РезервыНоменклатуры
		|ГДЕ
		|	ВТ_РезервыНоменклатуры.асЗаказНаряд = &ЗаказНаряд
		//|	И ВТ_РезервыНоменклатуры.СкладУчета = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|	И ВТ_РезервыНоменклатуры.Количество > 0
		|	И (ВТ_РезервыНоменклатуры.РезервТекущегоЗаказНаряда = ""Частично готов к выдаче""
		|		ИЛИ ВТ_РезервыНоменклатуры.РезервТекущегоЗаказНаряда = ""Ожидание наличия"")
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РезервыНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// --- Инфостарт #2507 03.09.2021
		|ВЫБРАТЬ
		|	асЗакупкаЗапчастей.Номенклатура КАК Номенклатура,
		|	СУММА(асЗакупкаЗапчастей.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ЗакупкаЗапчастей
		|ИЗ
		|	РегистрСведений.асЗакупкаЗапчастей КАК асЗакупкаЗапчастей
		|ГДЕ
		|	асЗакупкаЗапчастей.дмДатаОтмены = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И асЗакупкаЗапчастей.дмПричинаОтмены = """"
		|	И асЗакупкаЗапчастей.ЗаказНаряд = &ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	асЗакупкаЗапчастей.Номенклатура
		|
		// +++ Инфостарт #5117 21.10.2021 Учет перемещенных в ремонт запчастей и запчастей, не участвующих в резерве
		|ИМЕЮЩИЕ
		|	СУММА(асЗакупкаЗапчастей.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение списка товаров, по которым оформлены документы возврата из ремонта
		|ВЫБРАТЬ
		|	ТоварыСВозвратом.Номенклатура КАК Номенклатура,
		|	ТоварыСВозвратом.КоличествоПеремещение КАК КоличествоПеремещение,
		|	ТоварыСВозвратом.КоличествоВозврат КАК КоличествоВозврат
		|ПОМЕСТИТЬ ВТ_ТоварыСВозвратом
		|ИЗ
		|	&ТоварыСВозвратом КАК ТоварыСВозвратом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение количества товаров из заказ-наряда
		|ВЫБРАТЬ
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.Ссылка.RMS_СкладХраненияЗапасов КАК СтруктурнаяЕдиница,
		|	СУММА(Док.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыЗН
		|ИЗ
		|	Документ.асЗаказНаряд.МатериалыЗаказчика КАК Док
		|ГДЕ
		|	Док.Ссылка = &ЗаказНаряд
		|
		|СГРУППИРОВАТЬ ПО
		|	Док.Номенклатура,
		|	Док.Ссылка.RMS_СкладХраненияЗапасов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|ПОМЕСТИТЬ ВТСкладыДС
		|ИЗ
		|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
		|ГДЕ
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение = &Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
	// +++ Инфостарт 25.11.2021 Добавление учета аналогов
	Если НЕ ПолучитьФункциональнуюОпцию("дмИспользоватьАналоги") Тогда
		
		Запрос.Текст = Запрос.Текст + "
		// --- Инфостарт 25.11.2021
		// Получение свободного остатка товаров на складе
		|ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	Т.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СУММА(Т.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Ост
		|ИЗ
		|	(ВЫБРАТЬ
		|		Остатки.Номенклатура КАК Номенклатура,
		|		Остатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		Остатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				,
		|				Номенклатура В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Т.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТ_ТоварыЗН КАК Т)
		// +++ Инфостарт 25.11.2021
		|					И НЕ &СкладСРаспределением
		// --- Инфостарт 25.11.2021
		|					И СтруктурнаяЕдиница В
		|							(ВЫБРАТЬ
		|								ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|							ИЗ
		|								ВТСкладыДС КАК ВТСкладыДС)) КАК Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Резервы.Номенклатура,
		|		Резервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ВЫБОР
		|			КОГДА Резервы.КоличествоОстаток > 0
		|				ТОГДА -Резервы.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		|				,
		|				асЗаказНаряд <> &ЗаказНаряд
		|					И Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ТоварыЗН КАК Т)
		// +++ Инфостарт 25.11.2021
		|					И НЕ &СкладСРаспределением
		// --- Инфостарт 25.11.2021
		|					И СтруктурнаяЕдиница В
		|							(ВЫБРАТЬ
		|								ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|							ИЗ
		|								ВТСкладыДС КАК ВТСкладыДС)) КАК Резервы) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Номенклатура,
		|	Т.СтруктурнаяЕдиница
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение свободного остатка товаров на складах с распределением
		|ВЫБРАТЬ
		|	Т.Номенклатура КАК Номенклатура,
		|	СУММА(Т.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстРаспределение
		|ИЗ
		|	(ВЫБРАТЬ
		|		Остатки.Номенклатура КАК Номенклатура,
		|		Остатки.КоличествоОстаток КАК КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|				,
		|				Номенклатура В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						Т.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТ_ТоварыЗН КАК Т)
		|					И СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		// +++ Инфостарт 25.11.2021
		//|					И СтруктурнаяЕдиница <> &СкладЗН) КАК Остатки
		|					И (&СкладСРаспределением ИЛИ НЕ СтруктурнаяЕдиница В
		|						(ВЫБРАТЬ
		|							ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|						ИЗ
		|							ВТСкладыДС КАК ВТСкладыДС))) КАК Остатки
		// --- Инфостарт 25.11.2021
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Резервы.Номенклатура,
		|		ВЫБОР
		|			КОГДА Резервы.КоличествоОстаток > 0
		|				ТОГДА -Резервы.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		|				,
		|				асЗаказНаряд <> &ЗаказНаряд
		|					И Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ТоварыЗН КАК Т)
		|					И СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		// +++ Инфостарт 25.11.2021
		//|					И СтруктурнаяЕдиница <> &СкладЗН) КАК Резервы) КАК Т
		|					И (&СкладСРаспределением ИЛИ НЕ СтруктурнаяЕдиница В
		|						(ВЫБРАТЬ
		|							ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|						ИЗ
		|							ВТСкладыДС КАК ВТСкладыДС))) КАК Резервы) КАК Т
		// --- Инфостарт 25.11.2021
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.КоличествоОстаток) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТ_ТоварыЗН.Количество) КАК КоличествоБезРезерва
		|ПОМЕСТИТЬ ВТ_ТоварыБезРезерва
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыНоменклатуры КАК ВТ_РезервыНоменклатуры
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_РезервыНоменклатуры.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ВТ_РезервыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		// +++ Инфостарт 28.12.2021 Добавление товаров без резерва и перемещения
		|	И НЕ ВТ_ТоварыЗН.Номенклатура В (&ТоварыВПеремещениях)
		// --- Инфостарт 28.12.2021
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// --- Инфостарт 24.12.2021
		// Вычисление количества, необходимого для закупки, по товарам с возвратом и не участвующих в резерве
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыЗН.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	МАКСИМУМ(ВЫБОР
		// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
		//|		КОГДА ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) > 0 ИЛИ ВТ_ТоварыЗН.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		|		КОГДА ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) > 0
		// --- Инфостарт #8008 21.01.2022
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|				ИЛИ ЕСТЬNULL(ВТ_ТоварыБезРезерва.КоличествоБезРезерва, 0) > 0
		// --- Инфостарт 24.12.2021
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ) КАК ВычислятьОтдельно,
		|	СУММА(ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) > 0
		|			ТОГДА ВТ_ТоварыЗН.Количество - ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоПеремещение, 0) + ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) - ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0)
		// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
		//|		КОГДА ВТ_ТоварыЗН.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		//|			ТОГДА ВТ_ТоварыЗН.Количество - ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0)
		// --- Инфостарт #8008 21.01.2022
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|		КОГДА ЕСТЬNULL(ВТ_ТоварыБезРезерва.КоличествоБезРезерва, 0) > 0
		|			ТОГДА ВТ_ТоварыЗН.Количество - ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0)
		// --- Инфостарт 24.12.2021
		|	КОНЕЦ) КАК НеобходимоЗакупить
		|ПОМЕСТИТЬ ВТ_ТоварыДополнительные
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыСВозвратом КАК ВТ_ТоварыСВозвратом
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ТоварыСВозвратом.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакупкаЗапчастей КАК ВТ_ЗакупкаЗапчастей
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ЗакупкаЗапчастей.Номенклатура
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыБезРезерва КАК ВТ_ТоварыБезРезерва
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ТоварыБезРезерва.Номенклатура
		// --- Инфостарт 24.12.2021
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура,
		|	ВТ_ТоварыЗН.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Сравнение количества, необходимого для закупки со свободным остатком
		|ВЫБРАТЬ
		|	ВТ_ТоварыДополнительные.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыДополнительные.ВычислятьОтдельно КАК ВычислятьОтдельно,
		|	ВЫБОР
		|		КОГДА ВТ_ТоварыДополнительные.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		|			ТОГДА ВЫБОР
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить <= ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|					ТОГДА 0
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|						И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) > ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|					ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|						И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) <= ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|					ТОГДА 0
		|				ИНАЧЕ ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			КОНЕЦ
		|		КОГДА ВТ_ТоварыДополнительные.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДляЗакупки
		|ПОМЕСТИТЬ ВТ_ТоварыДополнительныеИтог
		|ИЗ
		|	ВТ_ТоварыДополнительные КАК ВТ_ТоварыДополнительные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ост КАК ВТ_Ост
		|		ПО ВТ_ТоварыДополнительные.Номенклатура = ВТ_Ост.Номенклатура
		|			И ВТ_ТоварыДополнительные.СтруктурнаяЕдиница = ВТ_Ост.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстРаспределение КАК ВТ_ОстРаспределение
		|		ПО ВТ_ТоварыДополнительные.Номенклатура = ВТ_ОстРаспределение.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ВТ_ТоварыДополнительные.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		|			ТОГДА ВЫБОР
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить <= ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|					ТОГДА 0
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|						И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) > ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|					ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|				КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|						И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) <= ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|					ТОГДА 0
		|				ИНАЧЕ ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			КОНЕЦ
		|		КОГДА ВТ_ТоварыДополнительные.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ > 0";
		// --- Инфостарт #5117 21.10.2021
		
	// +++ Инфостарт 25.11.2021 Добавление учета аналогов
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
		// Поиск оригиналов по аналогам номенклатуры из заказ-наряда
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(АналогиНоменклатуры.Номенклатура, ВТ_ТоварыЗН.Номенклатура)) КАК НоменклатураОригинал
		|ПОМЕСТИТЬ ВТ_НайденныеОригиналы
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|		ПО ВТ_ТоварыЗН.Номенклатура = АналогиНоменклатуры.Аналог
		|ГДЕ
		|	ВТ_ТоварыЗН.Номенклатура.дмЭтоАналог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Объединение найденных оригиналов с оригиналами товаров из документа
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыЗН.Номенклатура КАК НоменклатураОригинал
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|ГДЕ
		|	НЕ ВТ_ТоварыЗН.Номенклатура.дмЭтоАналог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение аналогов по найденным оригиналам (оригинал-аналог)
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал КАК Номенклатура,
		|	АналогиНоменклатуры.Аналог КАК НоменклатураАналог
		|ПОМЕСТИТЬ ВТ_ТоварыОригиналы
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		// +++ Инфостарт #8008 21.01.2022
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		// --- Инфостарт #8008 21.01.2022
		|		ПО ВТ_НайденныеОригиналы.НоменклатураОригинал = АналогиНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Добавление строк оригинал-оригинал для получения остатков
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал,
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Группировка всех строк аналог-оригинал для исключения дублей
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТ_НайденныеОригиналы.НоменклатураОригинал) КАК НоменклатураОригинал
		|ПОМЕСТИТЬ ВТ_ВсеАналогиОригиналы
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НайденныеОригиналы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Группировка всех строк оригинал-аналог для исключения дублей
		|ВЫБРАТЬ
		|	ВТ_ТоварыОригиналы.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыОригиналы.НоменклатураАналог КАК НоменклатураАналог
		|ПОМЕСТИТЬ ВТ_ВсеОригиналыАналоги
		|ИЗ
		|	ВТ_ТоварыОригиналы КАК ВТ_ТоварыОригиналы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыОригиналы.Номенклатура,
		|	ВТ_ТоварыОригиналы.НоменклатураАналог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение свободного остатка товаров на складе
		|ВЫБРАТЬ
		|	ВТ_ВсеОригиналыАналоги.Номенклатура КАК Номенклатура,
		|	Т.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СУММА(ЕСТЬNULL(Т.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Ост
		|ИЗ
		|	ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Остатки.Номенклатура КАК Номенклатура,
		|			Остатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			Остатки.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|					,
		|					Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.НоменклатураАналог КАК Номенклатура
		|						ИЗ
		|							ВТ_ВсеОригиналыАналоги КАК Т)
		|						И НЕ &СкладСРаспределением
		|						И СтруктурнаяЕдиница В
		|								(ВЫБРАТЬ
		|									ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|								ИЗ
		|									ВТСкладыДС КАК ВТСкладыДС)) КАК Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Резервы.Номенклатура,
		|		Резервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		ВЫБОР
		|			КОГДА Резервы.КоличествоОстаток > 0
		|				ТОГДА -Резервы.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		|				,
		|				асЗаказНаряд <> &ЗаказНаряд
		|					И Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.НоменклатураАналог КАК Номенклатура
		|						ИЗ
		|							ВТ_ВсеОригиналыАналоги КАК Т)
		|					И НЕ &СкладСРаспределением
		|					И СтруктурнаяЕдиница В
		|							(ВЫБРАТЬ
		|								ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|							ИЗ
		|								ВТСкладыДС КАК ВТСкладыДС)) КАК Резервы) КАК Т
		|	ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = Т.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеОригиналыАналоги.Номенклатура,
		|	Т.СтруктурнаяЕдиница
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(Т.КоличествоОстаток, 0)) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение свободного остатка товаров на складах с распределением
		|ВЫБРАТЬ
		|	ВТ_ВсеОригиналыАналоги.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(Т.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстРаспределение
		|ИЗ
		|	ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Остатки.Номенклатура КАК Номенклатура,
		|			Остатки.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|					,
		|					Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.НоменклатураАналог КАК Номенклатура
		|						ИЗ
		|							ВТ_ВсеОригиналыАналоги КАК Т)
		|						И СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|						И (&СкладСРаспределением ИЛИ НЕ СтруктурнаяЕдиница В
		|							(ВЫБРАТЬ
		|								ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|							ИЗ
		|								ВТСкладыДС КАК ВТСкладыДС))) КАК Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Резервы.Номенклатура,
		|		ВЫБОР
		|			КОГДА Резервы.КоличествоОстаток > 0
		|				ТОГДА -Резервы.КоличествоОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		|				,
		|				асЗаказНаряд <> &ЗаказНаряд
		|					И Номенклатура В
		|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|							Т.НоменклатураАналог КАК Номенклатура
		|						ИЗ
		|							ВТ_ВсеОригиналыАналоги КАК Т)
		|					И СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|					И (&СкладСРаспределением ИЛИ НЕ СтруктурнаяЕдиница В
		|							(ВЫБРАТЬ
		|								ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
		|							ИЗ
		|								ВТСкладыДС КАК ВТСкладыДС))) КАК Резервы) КАК Т
		|	ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = Т.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеОригиналыАналоги.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(Т.КоличествоОстаток, 0)) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВТ_ТоварыЗН.Количество) КАК КоличествоБезРезерва
		|ПОМЕСТИТЬ ВТ_ТоварыБезРезерва
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыНоменклатуры КАК ВТ_РезервыНоменклатуры
		|			ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = ВТ_РезервыНоменклатуры.Номенклатура
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ВсеОригиналыАналоги.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ВТ_РезервыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		// +++ Инфостарт 28.12.2021 Добавление товаров без резерва и перемещения
		|	И НЕ ВТ_ТоварыЗН.Номенклатура В (&ТоварыВПеремещениях)
		// --- Инфостарт 28.12.2021
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// --- Инфостарт 24.12.2021
		// Вычисление количества, необходимого для закупки, по товарам с возвратом и не участвующих в резерве
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыЗН.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	МАКСИМУМ(ВЫБОР
		// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
		//|		КОГДА ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) > 0 ИЛИ ВТ_ТоварыЗН.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		|		КОГДА ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0) > 0
		// --- Инфостарт #8008 21.01.2022
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|				ИЛИ ЕСТЬNULL(ВТ_ТоварыБезРезерва.КоличествоБезРезерва, 0) > 0
		// --- Инфостарт 24.12.2021
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ) КАК ВычислятьОтдельно,
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0)) > 0
		|			ТОГДА МАКСИМУМ(ВТ_ТоварыЗН.Количество) - СУММА(ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоПеремещение, 0)) + СУММА(ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0)) - МАКСИМУМ(ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0))
		// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
		//|		КОГДА ВТ_ТоварыЗН.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА
		//|			ТОГДА МАКСИМУМ(ВТ_ТоварыЗН.Количество) - МАКСИМУМ(ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0))
		// --- Инфостарт #8008 21.01.2022
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|		КОГДА СУММА(ЕСТЬNULL(ВТ_ТоварыБезРезерва.КоличествоБезРезерва, 0)) > 0
		|			ТОГДА МАКСИМУМ(ВТ_ТоварыЗН.Количество) - МАКСИМУМ(ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0))
		// --- Инфостарт 24.12.2021
		|	КОНЕЦ КАК НеобходимоЗакупить
		|ПОМЕСТИТЬ ВТ_ТоварыДополнительные
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыСВозвратом КАК ВТ_ТоварыСВозвратом
		|			ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = ВТ_ТоварыСВозвратом.Номенклатура
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ВсеОригиналыАналоги.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакупкаЗапчастей КАК ВТ_ЗакупкаЗапчастей
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ЗакупкаЗапчастей.Номенклатура
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыБезРезерва КАК ВТ_ТоварыБезРезерва
		|		ПО ВТ_ТоварыЗН.Номенклатура = ВТ_ТоварыБезРезерва.Номенклатура
		// --- Инфостарт 24.12.2021
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура,
		|	ВТ_ТоварыЗН.СтруктурнаяЕдиница
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ЕСТЬNULL(ВТ_ТоварыСВозвратом.КоличествоВозврат, 0)) > 0
		// +++ Инфостарт 24.12.2021 Добавление товаров без резерва и перемещения
		|		ИЛИ СУММА(ЕСТЬNULL(ВТ_ТоварыБезРезерва.КоличествоБезРезерва, 0)) > 0)
		// --- Инфостарт 24.12.2021
		// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
		//|		ИЛИ ВТ_ТоварыЗН.Номенклатура.дмНеУчаствуетВРезервах = ИСТИНА)
		// --- Инфостарт #8008 21.01.2022
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Добавление оригинала к дополнительным товарам для дальнейшей загрузки остатков
		|ВЫБРАТЬ
		|	ВТ_ТоварыДополнительные.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_ВсеАналогиОригиналы.НоменклатураОригинал, ВТ_ТоварыДополнительные.Номенклатура) КАК НоменклатураОригинал,
		|	ВТ_ТоварыДополнительные.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТ_ТоварыДополнительные.ВычислятьОтдельно КАК ВычислятьОтдельно,
		|	ВТ_ТоварыДополнительные.НеобходимоЗакупить КАК НеобходимоЗакупить
		|ПОМЕСТИТЬ ВТ_ТоварыДополнительныеОригиналы
		|ИЗ
		|	ВТ_ТоварыДополнительные КАК ВТ_ТоварыДополнительные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеАналогиОригиналы КАК ВТ_ВсеАналогиОригиналы
		|		ПО ВТ_ТоварыДополнительные.Номенклатура = ВТ_ВсеАналогиОригиналы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Сравнение количества, необходимого для закупки со свободным остатком
		|ВЫБРАТЬ
		|	ВТ_ТоварыДополнительные.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыДополнительные.ВычислятьОтдельно КАК ВычислятьОтдельно,
		|	ВЫБОР
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить <= ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			ТОГДА 0
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) > ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|			ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) <= ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|	КОНЕЦ КАК КоличествоДляЗакупки
		|ПОМЕСТИТЬ ВТ_ТоварыДополнительныеИтог
		|ИЗ
		|	ВТ_ТоварыДополнительныеОригиналы КАК ВТ_ТоварыДополнительные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ост КАК ВТ_Ост
		|		ПО ВТ_ТоварыДополнительные.НоменклатураОригинал = ВТ_Ост.Номенклатура
		|			И ВТ_ТоварыДополнительные.СтруктурнаяЕдиница = ВТ_Ост.СтруктурнаяЕдиница
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстРаспределение КАК ВТ_ОстРаспределение
		|		ПО ВТ_ТоварыДополнительные.НоменклатураОригинал = ВТ_ОстРаспределение.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить <= ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|			ТОГДА 0
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) > ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|			ТОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|		КОГДА ВТ_ТоварыДополнительные.НеобходимоЗакупить > ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|				И ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) <= ЕСТЬNULL(ВТ_ОстРаспределение.КоличествоОстаток, 0)
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ТоварыДополнительные.НеобходимоЗакупить - ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)
		|	КОНЕЦ > 0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	// --- Инфостарт 19.11.2021
	
		// +++ Инфостарт #2507 03.09.2021
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_МатериалыЗаказчикаГруп.Номенклатура КАК Номенклатура,
		//|	ВТ_МатериалыЗаказчикаГруп.Характеристика КАК Характеристика,
		//|	МАКСИМУМ(ВТ_МатериалыЗаказчикаГруп.Количество) КАК КоличествоВЗаказе,
		//|	СУММА(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_Резервы.Количество, 0)) КАК ОстатокБезРезерва
		//|ПОМЕСТИТЬ ВТ_МатериалыНедостаток
		//|ИЗ
		//|	ВТ_МатериалыЗаказчикаГруп КАК ВТ_МатериалыЗаказчикаГруп
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
		//|		ПО ВТ_МатериалыЗаказчикаГруп.Номенклатура = ВТ_Резервы.Номенклатура
		//|			И ВТ_МатериалыЗаказчикаГруп.Характеристика = ВТ_Резервы.Характеристика
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		//|		ПО ВТ_МатериалыЗаказчикаГруп.Номенклатура = ВТ_Остатки.Номенклатура
		//|			И ВТ_МатериалыЗаказчикаГруп.Характеристика = ВТ_Остатки.Характеристика
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_МатериалыЗаказчикаГруп.Номенклатура,
		//|	ВТ_МатериалыЗаказчикаГруп.Характеристика
		//|
		//|ИМЕЮЩИЕ
		//|	МАКСИМУМ(ВТ_МатериалыЗаказчикаГруп.Количество) > СУММА(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_Резервы.Количество, 0))
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_МатериалыНедостаток.Номенклатура КАК Номенклатура,
		//|	СУММА(ВЫБОР
		//|			КОГДА ВТ_МатериалыНедостаток.ОстатокБезРезерва > 0
		//|				ТОГДА ВТ_МатериалыНедостаток.КоличествоВЗаказе - ВТ_МатериалыНедостаток.ОстатокБезРезерва
		//|			ИНАЧЕ ВТ_МатериалыНедостаток.КоличествоВЗаказе
		//|		КОНЕЦ) КАК КоличествоНедостаток
		//|ПОМЕСТИТЬ ВТ_МатериалыНедостатокГруп
		//|ИЗ
		//|	ВТ_МатериалыНедостаток КАК ВТ_МатериалыНедостаток
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_МатериалыНедостаток.Номенклатура
		// --- Инфостарт #2507 03.09.2021
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МатериалыНедостатокГруп.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0) > 0
		|			ТОГДА ВТ_МатериалыНедостатокГруп.КоличествоНедостаток - ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0)
		|		ИНАЧЕ ВТ_МатериалыНедостатокГруп.КоличествоНедостаток
		|	КОНЕЦ КАК КоличествоЗакупить
		|ИЗ
		|	ВТ_МатериалыНедостатокГруп КАК ВТ_МатериалыНедостатокГруп
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакупкаЗапчастей КАК ВТ_ЗакупкаЗапчастей
		|		ПО ВТ_МатериалыНедостатокГруп.Номенклатура = ВТ_ЗакупкаЗапчастей.Номенклатура
		// +++ Инфостарт #5117 21.10.2021
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыДополнительныеИтог КАК ВТ_ТоварыДополнительныеИтог
		|		ПО ВТ_МатериалыНедостатокГруп.Номенклатура = ВТ_ТоварыДополнительныеИтог.Номенклатура
		// --- Инфостарт #5117 21.10.2021
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0) > 0
		|				ТОГДА ВТ_МатериалыНедостатокГруп.КоличествоНедостаток - ЕСТЬNULL(ВТ_ЗакупкаЗапчастей.Количество, 0)
		|			ИНАЧЕ ВТ_МатериалыНедостатокГруп.КоличествоНедостаток
		// +++ Инфостарт #5117 21.10.2021 По товарам с возвратом и не участвующих в резерве вычисление выполняется по другой формуле
		//|		КОНЕЦ > 0";
		|		КОНЕЦ > 0
		|	И ЕСТЬNULL(ВТ_ТоварыДополнительныеИтог.ВычислятьОтдельно, ЛОЖЬ) = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТоварыДополнительныеИтог.Номенклатура,
		|	ВТ_ТоварыДополнительныеИтог.КоличествоДляЗакупки
		|ИЗ
		|	ВТ_ТоварыДополнительныеИтог КАК ВТ_ТоварыДополнительныеИтог";
		// --- Инфостарт #5117 21.10.2021
	
	// +++ Инфостарт #2507 03.09.2021
	//ТаблицаМатериалыЗаказчика = Объект[ИмяТабличнойЧасти].Выгрузить(, "Номенклатура, Характеристика, Количество");
	//
	//Запрос.УстановитьПараметр("ЗаказНаряд",         Объект.Ссылка);
	//Запрос.УстановитьПараметр("Организация",        Объект.Организация);
	//Запрос.УстановитьПараметр("МатериалыЗаказчика", ТаблицаМатериалыЗаказчика);
	Запрос.УстановитьПараметр("ЗаказНаряд",          Объект.Ссылка);
	
	// +++ Инфостарт #5117 21.10.2021 Устранение ошибки дублирования количества из-за двойного резерва по своему и пустому складу
	//Запрос.УстановитьПараметр("РезервыНоменклатуры", РезервыНоменклатуры.Выгрузить());
	РезервыОбработанные = РезервыНоменклатуры.Выгрузить();
	
	МассивУдаляемыхРезервов = Новый Массив;
	
	Для каждого СтрокаРезерва Из РезервыОбработанные Цикл
		Если ЗначениеЗаполнено(СтрокаРезерва.СкладРезерва) И НЕ ЗначениеЗаполнено(СтрокаРезерва.СкладУчета) Тогда
			
			ОтборРезерва = Новый Структура;
			ОтборРезерва.Вставить("асЗаказНаряд",   СтрокаРезерва.асЗаказНаряд);
			ОтборРезерва.Вставить("Номенклатура",   СтрокаРезерва.Номенклатура);
			ОтборРезерва.Вставить("Характеристика", СтрокаРезерва.Характеристика);
			ОтборРезерва.Вставить("СкладУчета",     Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
			ОтборРезерва.Вставить("СкладРезерва",   Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
			
			НайденныеРезервы = РезервыОбработанные.НайтиСтроки(ОтборРезерва);
			
			Для каждого НайденныйРезерв Из НайденныеРезервы Цикл
				МассивУдаляемыхРезервов.Добавить(НайденныйРезерв);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	// +++ Инфостарт #8008 21.01.2022 Корректировка закупки под новые статусы нерезервируемых товаров
	МассивДавСкладов = ПолучитьМассивДавСкладов();
	
	Для каждого СтрокаМатериала Из Объект.МатериалыЗаказчика Цикл
		Если СтрокаМатериала.Номенклатура.дмНеУчаствуетВРезервах Тогда
			
			ОтборМатериала = Новый Структура;
			ОтборМатериала.Вставить("асЗаказНаряд", Объект.Ссылка);
			ОтборМатериала.Вставить("Номенклатура", СтрокаМатериала.Номенклатура);
			
			НайденныеРезервы = РезервыОбработанные.НайтиСтроки(ОтборМатериала);
			
			Если СтрокаМатериала.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков на складе достаточно для получения"
					И НайденныеРезервы.Количество() > 0 Тогда
				
				Для каждого НайденныйРезерв Из НайденныеРезервы Цикл
					НайденныйРезерв.Количество = 0;
				КонецЦикла;
				
			ИначеЕсли СтрокаМатериала.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков на складе достаточно для получения"
					И НайденныеРезервы.Количество() = 0 Тогда
				
				НовыйРезерв = РезервыОбработанные.Добавить();
				НовыйРезерв.асЗаказНаряд = Объект.Ссылка;
				НовыйРезерв.Номенклатура = СтрокаМатериала.Номенклатура;
				НовыйРезерв.РезервТекущегоЗаказНаряда = "Ожидание наличия";
				НовыйРезерв.Количество   = 0;
				
				Если МассивДавСкладов.Количество() > 0 Тогда
					НовыйРезерв.СкладУчета = МассивДавСкладов[0];
				Иначе
					НовыйРезерв.СкладУчета = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	// --- Инфостарт #8008 21.01.2022
	
	Для каждого УдаляемыйРезерв Из МассивУдаляемыхРезервов Цикл
		РезервыОбработанные.Удалить(УдаляемыйРезерв);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("РезервыНоменклатуры", РезервыОбработанные);
	Запрос.УстановитьПараметр("ТоварыСВозвратом",    ТоварыСВозвратом);
	Запрос.УстановитьПараметр("Подразделение",       Объект.Подразделение);
	// +++ Инфостарт 25.11.2021
	//Запрос.УстановитьПараметр("СкладЗН", Объект.RMS_СкладХраненияЗапасов);
	Запрос.УстановитьПараметр("СкладСРаспределением", Объект.RMS_СкладХраненияЗапасов.дмРаспределятьРезервЗапчастейНаСкладе);
	// --- Инфостарт 25.11.2021
	// --- Инфостарт #5117 21.10.2021
	// --- Инфостарт #2507 03.09.2021
	
	// +++ Инфостарт 28.12.2021 Добавление товаров без резерва и перемещения
	Запрос.УстановитьПараметр("ТоварыВПеремещениях", ТоварыВПеремещениях);
	// --- Инфостарт 28.12.2021
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДЗ = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Пока ВыборкаДЗ.Следующий() Цикл
		
		// +++ Инфостарт 23.11.2021 Пропуск закупок с несколькими перемещениями
		Если МассивПропуска.Найти(ВыборкаДЗ.Номенклатура) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// --- Инфостарт 23.11.2021
		
		// Создание новых записей закупок
		НаборЗаписейЗакупки = РегистрыСведений.асЗакупкаЗапчастей.СоздатьНаборЗаписей();
		НаборЗаписейЗакупки.Отбор.ЗаказНаряд.Установить(Объект.Ссылка);
		НаборЗаписейЗакупки.Отбор.Номенклатура.Установить(ВыборкаДЗ.Номенклатура);
		НаборЗаписейЗакупки.Прочитать();
		
		СтрокаЗакупок = НаборЗаписейЗакупки.Добавить();
		СтрокаЗакупок.ЗаказНаряд   = Объект.Ссылка;
		СтрокаЗакупок.Номенклатура = ВыборкаДЗ.Номенклатура;
		СтрокаЗакупок.Автор        = Пользователи.ТекущийПользователь();
		СтрокаЗакупок.Период       = ТекущаяДата();
		СтрокаЗакупок.Количество   = ВыборкаДЗ.КоличествоЗакупить;
		
		НаборЗаписейЗакупки.Записать();
		
		// Установка галочек "Резервировать"
		СтрокиТовара = Объект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура("Номенклатура", ВыборкаДЗ.Номенклатура));
		
		Для Каждого СтрокаТовара Из СтрокиТовара Цикл
			СтрокаТовара.дмРезервировать = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ИмяТабличнойЧасти = "МатериалыЗаказчика" Тогда
		Элементы.ЗакупкиЗапчастей1.Обновить();
	Иначе
		Элементы.ЗакупкиЗапчастей.Обновить();
	КонецЕсли;
	
	// Запись документа
	Если Объект.Проведен Тогда
		ДокументЗаписан = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Иначе
		ДокументЗаписан = Записать();
	КонецЕсли;
	
	Если НЕ ДокументЗаписан Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось записать документ. Заказ не выполнен'"));
		ОтменитьТранзакцию();
		
	Иначе
		
		ПолеЗН = Новый ПолеКомпоновкиДанных("ЗаказНаряд");
		
		Для Каждого ЭлементОтбора Из ЗакупкиЗапчастей.Отбор.Элементы Цикл
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ЭлементОтбора.ЛевоеЗначение = ПолеЗН Тогда
				ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		Если ИмяТабличнойЧасти = "МатериалыЗаказчика" Тогда
			Элементы.ЗакупкиЗапчастей1.Обновить();
		Иначе
			Элементы.ЗакупкиЗапчастей.Обновить();
		КонецЕсли;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ЗаполнитьДанныеПоОстаткамНаСкладеХранения();
	
КонецПроцедуры
// --- Инфостарт #2507 01.09.2021

