//+RMS 70789
&НаСервере
Процедура ЗаполнитьДанныеПоОстаткамНаСкладеХранения()
	
	СписокНоменклатуры = Новый СписокЗначений;
	
	Для Каждого СтрокаЗапаса Из Объект.Запасы Цикл
		СтрокаЗапаса.RMS_НетОстаткаНаСкладеХранения = Истина;
		СписокНоменклатуры.Добавить(СтрокаЗапаса.Номенклатура);
	КонецЦикла;
	
	Для Каждого СтрокаДавалСырье Из Объект.МатериалыЗаказчика Цикл
		СтрокаДавалСырье.RMS_НетОстаткаНаСкладеХранения = Истина;
		СписокНоменклатуры.Добавить(СтрокаДавалСырье.Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	// +++ Инфостарт Васильев А.Э. 09.11.2021
	// #5620 Перенос механизма аналогов номенклатуры из СММ
	Если ПолучитьФункциональнуюОпцию("дмИспользоватьАналоги") Тогда
		 
		//кудр 20201202 DEV1C-3137
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка КАК СкладРегиона
		               |ПОМЕСТИТЬ ВТ_СкладыРегиона
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
		               |ГДЕ
		               |	СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Наименование = &НаименованиеОсн ИЛИ  СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Наименование = &НаименованиеДав
		               // +++ Инфостарт #2507 20.08.2021 Добавление отображения остатков по пустым складам
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               // --- Инфостарт #2507 20.08.2021
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // +++ Инфостарт #6829 10.12.2021 Перенаправление резервов на давальческий склад в зависимости от подразделения
		               |ВЫБРАТЬ
		               |	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение КАК Подразделение,
		               |	МАКСИМУМ(ВЫБОР
		               |		КОГДА дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |		ИНАЧЕ дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
		               |	КОНЕЦ) КАК СкладДавальческогоСырья
		               |ПОМЕСТИТЬ ВТ_ДавСклады
		               |ИЗ
		               |	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // Получение заказов поставщику с резервами на двух складах
		               |ВЫБРАТЬ
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд КАК асЗаказНаряд,
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура КАК Номенклатура,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница) КАК КоличествоСкладов
		               |ПОМЕСТИТЬ ВТ_КоличествоСкладов
		               |ИЗ
		               |	РегистрНакопления.RMS_РезервыПодЗаказНаряд.ОстаткиИОбороты(
		               |			,
		               |			,
		               |			Авто,
		               |			,
		               |			Номенклатура В (&Номенклатура)) КАК RMS_РезервыПодЗаказНарядОстаткиИОбороты
		               |ГДЕ
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказПоставщику
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд,
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // --- Инфостарт #6829 10.12.2021
					   // +++ Инфостарт Васильев А.Э. 09.11.2021
					   // #5620 Перенос механизма аналогов номенклатуры из СММ
					   |ВЫБРАТЬ
		               |	АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		               |	АналогиНоменклатуры.Аналог КАК Аналог
		               |ПОМЕСТИТЬ втАналоги
		               |ИЗ
		               |	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		               |ГДЕ
		               |	АналогиНоменклатуры.Номенклатура В(&Номенклатура)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
					   // --- Инфостарт Васильев А.Э. 09.11.2021
		               |ВЫБРАТЬ
		               |	ТаблицаДанных.Номенклатура КАК Номенклатура,
		               |	ТаблицаДанных.Склад КАК Склад,
		               |	СУММА(ТаблицаДанных.КоличествоОстаток) КАК КоличествоОстаток,
		               |	СУММА(ТаблицаДанных.КоличествоРезерв) КАК КоличествоРезерв
		               |ПОМЕСТИТЬ ВТ_Данные
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		               |		ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК Склад,
		               |		ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		               |		0 КАК КоличествоРезерв
		               |	ИЗ
		               |		РегистрНакопления.ЗапасыНаСкладах.Остатки(
		               |				&Дата,
		               // +++ Инфостарт #2507 20.08.2021 Добавление отображения остатков по пустым складам
		               //|				НЕ СтруктурнаяЕдиница.асПроизводственный
		               |				(СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ НЕ СтруктурнаяЕдиница.асПроизводственный)
		               // --- Инфостарт #2507 20.08.2021
		               |					И СтруктурнаяЕдиница В
		               |						(ВЫБРАТЬ
		               |							ВТ_СкладыРегиона.СкладРегиона
		               |						ИЗ
		               |							ВТ_СкладыРегиона)
		               |					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               // +++ Инфостарт #6829 10.12.2021 Перенаправление резервов на давальческий склад в зависимости от подразделения
		               |	ВЫБРАТЬ
		               |		RMS_РезервыПодЗаказНарядОстатки.Номенклатура,
		               |		ВЫБОР
		               |			КОГДА ЕСТЬNULL(ВТ_ДавСклады.СкладДавальческогоСырья, 0) = 0
		               |					ИЛИ (ЕСТЬNULL(ВТ_КоличествоСкладов.КоличествоСкладов, 2) > 1 И RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
		               |				ТОГДА RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница
		               |			ИНАЧЕ ВТ_ДавСклады.СкладДавальческогоСырья
		               |		КОНЕЦ,
		               |		0,
		               |		RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток
		               |	ИЗ
		               |		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		               |				&Дата,
		               |				((СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |						ИЛИ НЕ СтруктурнаяЕдиница.асПроизводственный)
		               |						И СтруктурнаяЕдиница В
		               |							(ВЫБРАТЬ
		               |								ВТ_СкладыРегиона.СкладРегиона
		               |							ИЗ
		               |								ВТ_СкладыРегиона)
		               |					ИЛИ (асЗаказНаряд.Подразделение, СтруктурнаяЕдиница) В
		               |						(ВЫБРАТЬ
		               |							ВТ_ДавСклады.Подразделение КАК Подразделение,
		               |							ВТ_ДавСклады.СкладДавальческогоСырья КАК СтруктурнаяЕдиница
		               |						ИЗ
		               |							ВТ_ДавСклады КАК ВТ_ДавСклады
		               |						ГДЕ     
		               |							(ВТ_ДавСклады.СкладДавальческогоСырья = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |								ИЛИ НЕ ВТ_ДавСклады.СкладДавальческогоСырья.асПроизводственный)
		               |							И ВТ_ДавСклады.СкладДавальческогоСырья В
		               |								(ВЫБРАТЬ
		               |									ВТ_СкладыРегиона.СкладРегиона
		               |								ИЗ
		               |									ВТ_СкладыРегиона)))
		               |					И Номенклатура В (&Номенклатура)) КАК RMS_РезервыПодЗаказНарядОстатки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДавСклады КАК ВТ_ДавСклады
		               |			ПО RMS_РезервыПодЗаказНарядОстатки.асЗаказНаряд.Подразделение = ВТ_ДавСклады.Подразделение
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСкладов КАК ВТ_КоличествоСкладов
		               |			ПО RMS_РезервыПодЗаказНарядОстатки.асЗаказНаряд = ВТ_КоличествоСкладов.асЗаказНаряд
		               |				И RMS_РезервыПодЗаказНарядОстатки.Номенклатура = ВТ_КоличествоСкладов.Номенклатура
		               |	ГДЕ
		               |		RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток > 0
		               // --- Инфостарт #6829 10.12.2021
					   // +++ Инфостарт Васильев А.Э. 09.11.2021
					   // #5620 Перенос механизма аналогов номенклатуры из СММ
					   |ОБЪЕДИНИТЬ ВСЕ
					   |
					   |ВЫБРАТЬ
					   |	втАналоги.Номенклатура,
					   |	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница,
					   |	ЗапасыНаСкладахОстатки.КоличествоОстаток,
					   |	0
					   |ИЗ
					   |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
					   |		&Дата,
					   |		(СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ НЕ СтруктурнаяЕдиница.асПроизводственный)		
					   |			И СтруктурнаяЕдиница В
					   |				(ВЫБРАТЬ
					   |					ВТ_СкладыРегиона.СкладРегиона
					   |				ИЗ
					   |					ВТ_СкладыРегиона)
					   |			И Номенклатура В
					   |				(ВЫБРАТЬ
					   |					втАналоги.Аналог
					   |				ИЗ
					   |					втАналоги КАК втАналоги)) КАК ЗапасыНаСкладахОстатки
					   |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втАналоги КАК втАналоги
					   |		ПО ЗапасыНаСкладахОстатки.Номенклатура = втАналоги.Аналог) КАК ТаблицаДанных
					   // --- Инфостарт Васильев А.Э. 09.11.2021
					   |
					   |СГРУППИРОВАТЬ ПО
					   |	ТаблицаДанных.Номенклатура,
					   |	ТаблицаДанных.Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Данные.Номенклатура КАК Номенклатура,
		               // +++ Инфостарт #2507 20.08.2021
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ""Распределять резерв""
		               |		ИНАЧЕ ВТ_Данные.Склад
		               |	КОНЕЦ КАК Склад,
		               // --- Инфостарт #2507 20.08.2021
		               |	ВТ_Данные.КоличествоОстаток КАК КоличествоОстаток,
		               |	ВТ_Данные.КоличествоРезерв КАК КоличествоРезерв,
		               // +++ Инфостарт #2507 20.08.2021
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |	КОНЕЦ КАК Распределять,
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ВТ_Данные.КоличествоОстаток
		               |		КОГДА ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ВТ_Данные.КоличествоОстаток
		               |		КОГДА ВТ_Данные.КоличествоОстаток > ВТ_Данные.КоличествоРезерв И НЕ ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ВТ_Данные.КоличествоОстаток - ВТ_Данные.КоличествоРезерв
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КоличествоВНаличии
		               // --- Инфостарт #2507 20.08.2021
		               |ИЗ
		               |	ВТ_Данные КАК ВТ_Данные
		               |ИТОГИ
		               |	СУММА(КоличествоОстаток),
		               |	СУММА(КоличествоРезерв),
		               |	СУММА(КоличествоВНаличии)
		               |ПО
		               |	Номенклатура";
	Иначе
	//кудр 20201202 DEV1C-3137
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтруктурныеЕдиницыДополнительныеРеквизиты.Ссылка КАК СкладРегиона
		               |ПОМЕСТИТЬ ВТ_СкладыРегиона
		               |ИЗ
		               |	Справочник.СтруктурныеЕдиницы.ДополнительныеРеквизиты КАК СтруктурныеЕдиницыДополнительныеРеквизиты
		               |ГДЕ
		               |	СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Наименование = &НаименованиеОсн ИЛИ  СтруктурныеЕдиницыДополнительныеРеквизиты.Свойство.Наименование = &НаименованиеДав
		               // +++ Инфостарт #2507 20.08.2021 Добавление отображения остатков по пустым складам
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               // --- Инфостарт #2507 20.08.2021
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // +++ Инфостарт #6829 10.12.2021 Перенаправление резервов на давальческий склад в зависимости от подразделения
		               |ВЫБРАТЬ
		               |	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение КАК Подразделение,
		               |	МАКСИМУМ(ВЫБОР
		               |		КОГДА дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |		ИНАЧЕ дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
		               |	КОНЕЦ) КАК СкладДавальческогоСырья
		               |ПОМЕСТИТЬ ВТ_ДавСклады
		               |ИЗ
		               |	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // Получение заказов поставщику с резервами на двух складах
		               |ВЫБРАТЬ
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд КАК асЗаказНаряд,
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура КАК Номенклатура,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница) КАК КоличествоСкладов
		               |ПОМЕСТИТЬ ВТ_КоличествоСкладов
		               |ИЗ
		               |	РегистрНакопления.RMS_РезервыПодЗаказНаряд.ОстаткиИОбороты(
		               |			,
		               |			,
		               |			Авто,
		               |			,
		               |			Номенклатура В (&Номенклатура)) КАК RMS_РезервыПодЗаказНарядОстаткиИОбороты
		               |ГДЕ
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказПоставщику
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд,
		               |	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               // --- Инфостарт #6829 10.12.2021
		               |ВЫБРАТЬ
		               |	ТаблицаДанных.Номенклатура КАК Номенклатура,
		               |	ТаблицаДанных.Склад КАК Склад,
		               |	СУММА(ТаблицаДанных.КоличествоОстаток) КАК КоличествоОстаток,
		               |	СУММА(ТаблицаДанных.КоличествоРезерв) КАК КоличествоРезерв
		               |ПОМЕСТИТЬ ВТ_Данные
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		               |		ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК Склад,
		               |		ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		               |		0 КАК КоличествоРезерв
		               |	ИЗ
		               |		РегистрНакопления.ЗапасыНаСкладах.Остатки(
		               |				&Дата,
		               // +++ Инфостарт #2507 20.08.2021 Добавление отображения остатков по пустым складам
		               |				(СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) ИЛИ НЕ СтруктурнаяЕдиница.асПроизводственный)
		               // --- Инфостарт #2507 20.08.2021
		               |					И СтруктурнаяЕдиница В
		               |						(ВЫБРАТЬ
		               |							ВТ_СкладыРегиона.СкладРегиона
		               |						ИЗ
		               |							ВТ_СкладыРегиона)
		               |					И Номенклатура В (&Номенклатура)) КАК ЗапасыНаСкладахОстатки
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               // +++ Инфостарт 08.12.2021 Перенаправление резервов на давальческий склад в зависимости от подразделения
		               |	ВЫБРАТЬ
		               |		RMS_РезервыПодЗаказНарядОстатки.Номенклатура,
		               |		ВЫБОР
		               |			КОГДА ЕСТЬNULL(ВТ_ДавСклады.СкладДавальческогоСырья, 0) = 0
		               |					ИЛИ (ЕСТЬNULL(ВТ_КоличествоСкладов.КоличествоСкладов, 2) > 1 И RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
		               |				ТОГДА RMS_РезервыПодЗаказНарядОстатки.СтруктурнаяЕдиница
		               |			ИНАЧЕ ВТ_ДавСклады.СкладДавальческогоСырья
		               |		КОНЕЦ,
		               |		0,
		               |		RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток
		               |	ИЗ
		               |		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		               |				&Дата,
		               |				((СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |						ИЛИ НЕ СтруктурнаяЕдиница.асПроизводственный)
		               |						И СтруктурнаяЕдиница В
		               |							(ВЫБРАТЬ
		               |								ВТ_СкладыРегиона.СкладРегиона
		               |							ИЗ
		               |								ВТ_СкладыРегиона)
		               |					ИЛИ (асЗаказНаряд.Подразделение, СтруктурнаяЕдиница) В
		               |						(ВЫБРАТЬ
		               |							ВТ_ДавСклады.Подразделение КАК Подразделение,
		               |							ВТ_ДавСклады.СкладДавальческогоСырья КАК СтруктурнаяЕдиница
		               |						ИЗ
		               |							ВТ_ДавСклады КАК ВТ_ДавСклады
		               |						ГДЕ
		               |							(ВТ_ДавСклады.СкладДавальческогоСырья = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |								ИЛИ НЕ ВТ_ДавСклады.СкладДавальческогоСырья.асПроизводственный)
		               |							И ВТ_ДавСклады.СкладДавальческогоСырья В
		               |								(ВЫБРАТЬ
		               |									ВТ_СкладыРегиона.СкладРегиона
		               |								ИЗ
		               |									ВТ_СкладыРегиона)))
		               |					И Номенклатура В (&Номенклатура)) КАК RMS_РезервыПодЗаказНарядОстатки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДавСклады КАК ВТ_ДавСклады
		               |			ПО RMS_РезервыПодЗаказНарядОстатки.асЗаказНаряд.Подразделение = ВТ_ДавСклады.Подразделение
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСкладов КАК ВТ_КоличествоСкладов
		               |			ПО RMS_РезервыПодЗаказНарядОстатки.асЗаказНаряд = ВТ_КоличествоСкладов.асЗаказНаряд
		               |				И RMS_РезервыПодЗаказНарядОстатки.Номенклатура = ВТ_КоличествоСкладов.Номенклатура
		               // --- Инфостарт 08.12.2021
		               |	ГДЕ
		               |		RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток > 0) КАК ТаблицаДанных
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаДанных.Номенклатура,
		               |	ТаблицаДанных.Склад
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Данные.Номенклатура КАК Номенклатура,
		               // +++ Инфостарт #2507 20.08.2021
		               //|	ВТ_Данные.Склад КАК Склад,
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ""Распределять резерв""
		               |		ИНАЧЕ ВТ_Данные.Склад
		               |	КОНЕЦ КАК Склад,
		               // --- Инфостарт #2507 20.08.2021
		               |	ВТ_Данные.КоличествоОстаток КАК КоличествоОстаток,
		               |	ВТ_Данные.КоличествоРезерв КАК КоличествоРезерв,
		               // +++ Инфостарт #2507 20.08.2021
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |	КОНЕЦ КАК Распределять,
		               |	ВЫБОР
		               |		КОГДА ВТ_Данные.Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		               |			ТОГДА ВТ_Данные.КоличествоОстаток
		               |		КОГДА ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ВТ_Данные.КоличествоОстаток
		               |		КОГДА ВТ_Данные.КоличествоОстаток > ВТ_Данные.КоличествоРезерв И НЕ ВТ_Данные.Склад.дмРаспределятьРезервЗапчастейНаСкладе
		               |			ТОГДА ВТ_Данные.КоличествоОстаток - ВТ_Данные.КоличествоРезерв
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КоличествоВНаличии
		               // --- Инфостарт #2507 20.08.2021
		               |ИЗ
		               |	ВТ_Данные КАК ВТ_Данные
		               |ИТОГИ
		               |	СУММА(КоличествоОстаток),
		               |	СУММА(КоличествоРезерв),
		               |	СУММА(КоличествоВНаличии)
		               |ПО
		               |	Номенклатура";
	КонецЕсли;

	//кудр 20201202 DEV1C-3137
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры);
	//кудр 20201202 DEV1C-3137
	Запрос.УстановитьПараметр("НаименованиеДав", "Давальческий склад (Структурные единицы)");
	Запрос.УстановитьПараметр("НаименованиеОсн", "Основной склад подбора товаров (Структурные единицы)");	
	//кудр 20201202 DEV1C-3137
	
	// +++ Инфостарт #2507 20.08.2021
	Запрос.УстановитьПараметр("ЗаказНаряд", Объект.Ссылка);
	// --- Инфостарт #2507 20.08.2021
	
	// +++ Инфостарт #8008 21.01.2022 Сохранение количества товара на складе для нерезервируемых товаров
	МассивДавСкладов = ПолучитьМассивДавСкладов();
	
	ОстаткиТоваровБезРезерва = Новый ТаблицаЗначений;
	ОстаткиТоваровБезРезерва.Колонки.Добавить("Номенклатура");
	ОстаткиТоваровБезРезерва.Колонки.Добавить("ОстатокНаСкладе");
	// --- Инфостарт #8008 21.01.2022
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		МасСтрокТоваров 	  = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
		МассивСтрокДавалСырье = Объект.МатериалыЗаказчика.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
		
		Для Каждого СтрокаТовара Из МасСтрокТоваров Цикл
			Если СтрокаТовара.Количество<=Выборка.КоличествоОстаток Тогда
				СтрокаТовара.RMS_НетОстаткаНаСкладеХранения = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДавалСырья Из МассивСтрокДавалСырье Цикл
			Если СтрокаДавалСырья.Количество<=Выборка.КоличествоОстаток Тогда
				СтрокаДавалСырья.RMS_НетОстаткаНаСкладеХранения = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		// +++ Инфостарт #6829 10.12.2021 Изменение вывода складов СММ. Теперь они выводятся вместе
		СуммаНаСкладахСММ   = 0;
		ОстатокНаСкладахСММ = 0;
		// --- Инфостарт #6829 10.12.2021
		
		// +++ Инфостарт #8008 21.01.2022 Сохранение количества товара на складе для нерезервируемых товаров
		ОстатокНаДавСкладах = 0;
		// --- Инфостарт #8008 21.01.2022
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		МассивСкладовОстатков = Новый Массив;
		МассивСкладовРезервов = Новый Массив;
		МассивСкладовВНаличии = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 Тогда
				МассивСкладовОстатков.Добавить(Строка(ВыборкаДетальныеЗаписи.Склад) + " - " + Формат(ВыборкаДетальныеЗаписи.КоличествоОстаток, "ЧГ=0"));
			КонецЕсли; 
			
			// +++ Инфостарт #6829 10.12.2021 Изменение вывода складов СММ. Теперь они выводятся вместе
			Если ВыборкаДетальныеЗаписи.КоличествоОстаток > 0 И ВыборкаДетальныеЗаписи.Распределять Тогда
				ОстатокНаСкладахСММ = ОстатокНаСкладахСММ + ВыборкаДетальныеЗаписи.КоличествоОстаток;
			КонецЕсли;
			// --- Инфостарт #6829 10.12.2021
			
			// +++ Инфостарт #2507 20.08.2021 Распределение резерва по остаткам и сложение складов СММ
			Если ВыборкаДетальныеЗаписи.КоличествоРезерв > 0 И НЕ ВыборкаДетальныеЗаписи.Распределять Тогда
				МассивСкладовРезервов.Добавить(Строка(ВыборкаДетальныеЗаписи.Склад) + " - " + Формат(ВыборкаДетальныеЗаписи.КоличествоРезерв, "ЧГ=0"));
			ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоРезерв > 0 И ВыборкаДетальныеЗаписи.Распределять Тогда
				СуммаНаСкладахСММ = СуммаНаСкладахСММ + ВыборкаДетальныеЗаписи.КоличествоРезерв;
			КонецЕсли;
			
			// +++ Инфостарт #6829 10.12.2021 Изменение вывода складов СММ. Теперь они выводятся вместе
			Если ВыборкаДетальныеЗаписи.КоличествоВНаличии > 0 И НЕ ВыборкаДетальныеЗаписи.Распределять Тогда
				МассивСкладовВНаличии.Добавить(Строка(ВыборкаДетальныеЗаписи.Склад) + " - " + Формат(ВыборкаДетальныеЗаписи.КоличествоВНаличии, "ЧГ=0"));
			КонецЕсли;
			// --- Инфостарт #6829 10.12.2021
			// --- Инфостарт #2507 20.08.2021
			
			// +++ Инфостарт #8008 21.01.2022 Сохранение количества товара на складе для нерезервируемых товаров
			Если МассивДавСкладов.Найти(ВыборкаДетальныеЗаписи.Склад) <> Неопределено Тогда
				ОстатокНаДавСкладах = ОстатокНаДавСкладах + ВыборкаДетальныеЗаписи.КоличествоВНаличии;
			КонецЕсли;
			// --- Инфостарт #8008 21.01.2022
			
		КонецЦикла;
		
		// +++ Инфостарт #2507 20.08.2021 Распределение резерва по остаткам и сложение складов СММ
		Если СуммаНаСкладахСММ > 0 Тогда
			МассивСкладовРезервов.Добавить("Склады СММ - " + Формат(СуммаНаСкладахСММ, "ЧГ=0"));
		КонецЕсли;
		// --- Инфостарт #2507 20.08.2021
		
		// +++ Инфостарт #6829 10.12.2021 Изменение вывода складов СММ. Теперь они выводятся вместе
		Если ОстатокНаСкладахСММ > СуммаНаСкладахСММ Тогда
			МассивСкладовВНаличии.Добавить("Склады СММ - " + Формат(ОстатокНаСкладахСММ - СуммаНаСкладахСММ, "ЧГ=0"));
		КонецЕсли;
		// --- Инфостарт #6829 10.12.2021
		
		Если МасСтрокТоваров.Количество() > 0 Тогда
			СтрокаТовара.дмСклад 			= СтрСоединить(МассивСкладовОстатков, "/");
			СтрокаТовара.дм_РезервНаСкладах = СтрСоединить(МассивСкладовРезервов, "/");
			СтрокаТовара.дм_ВНаличии	    = СтрСоединить(МассивСкладовВНаличии, "/");
		КонецЕсли;
		
		Если МассивСтрокДавалСырье.Количество() > 0 Тогда
			СтрокаДавалСырья.дмСклад 			= СтрСоединить(МассивСкладовОстатков, "/");
			СтрокаДавалСырья.дм_РезервНаСкладах = СтрСоединить(МассивСкладовРезервов, "/");
			СтрокаДавалСырья.дм_ВНаличии	    = СтрСоединить(МассивСкладовВНаличии, "/");
		КонецЕсли;
		
		// +++ Инфостарт #8008 21.01.2022 Сохранение количества товара на складе для нерезервируемых товаров
		Если ЗначениеЗаполнено(Выборка.Номенклатура) И Выборка.Номенклатура.дмНеУчаствуетВРезервах Тогда
			
			СтрокаБезРезерва = ОстаткиТоваровБезРезерва.Добавить();
			СтрокаБезРезерва.Номенклатура = Выборка.Номенклатура;
			
			Если МассивДавСкладов.Количество() = 0 Тогда
				СтрокаБезРезерва.ОстатокНаСкладе = ОстатокНаСкладахСММ - СуммаНаСкладахСММ;
			Иначе
				СтрокаБезРезерва.ОстатокНаСкладе = ОстатокНаДавСкладах;
			КонецЕсли;
			
		КонецЕсли;
		// --- Инфостарт #8008 21.01.2022
		
	КонецЦикла;
	
	// +++ Инфостарт #2507 26.08.2021 Добавление и заполнение новой колонки РезервТекущегоЗаказНаряда
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// +++ Инфостарт #2507 03.09.2021 Сохранение количества, которого не хватает на складе, для массовой закупки
	РезервыНоменклатуры.Очистить();
	// --- Инфостарт #2507 03.09.2021
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		// +++ Инфостарт 19.11.2021 Добавление учета аналогов товаров
		"ВЫБРАТЬ
		|	ТаблНоменклатура.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТоварыЗН
		|ИЗ
		|	&Номенклатура КАК ТаблНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Поиск оригиналов по аналогам номенклатуры из заказ-наряда
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(АналогиНоменклатуры.Номенклатура, ВТ_ТоварыЗН.Номенклатура)) КАК НоменклатураОригинал
		|ПОМЕСТИТЬ ВТ_НайденныеОригиналы
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|		ПО ВТ_ТоварыЗН.Номенклатура = АналогиНоменклатуры.Аналог
		|ГДЕ
		|	ВТ_ТоварыЗН.Номенклатура.дмЭтоАналог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Объединение найденных оригиналов с оригиналами товаров из документа
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗН.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыЗН.Номенклатура КАК НоменклатураОригинал
		|ИЗ
		|	ВТ_ТоварыЗН КАК ВТ_ТоварыЗН
		|ГДЕ
		|	НЕ ВТ_ТоварыЗН.Номенклатура.дмЭтоАналог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗН.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Получение аналогов по найденным оригиналам (оригинал-аналог)
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал КАК Номенклатура,
		|	АналогиНоменклатуры.Аналог КАК НоменклатураАналог
		|ПОМЕСТИТЬ ВТ_ТоварыОригиналы
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|		ПО ВТ_НайденныеОригиналы.НоменклатураОригинал = АналогиНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Добавление строк оригинал-оригинал для получения остатков
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал,
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Группировка всех строк оригинал-аналог для исключения дублей
		|ВЫБРАТЬ
		|	ВТ_ТоварыОригиналы.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыОригиналы.НоменклатураАналог КАК НоменклатураАналог
		|ПОМЕСТИТЬ ВТ_ВсеОригиналыАналоги
		|ИЗ
		|	ВТ_ТоварыОригиналы КАК ВТ_ТоварыОригиналы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыОригиналы.Номенклатура,
		|	ВТ_ТоварыОригиналы.НоменклатураАналог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		// Получение заказов поставщику с резервами на двух складах
		|ВЫБРАТЬ
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд КАК асЗаказНаряд,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница) КАК КоличествоСкладов
		|ПОМЕСТИТЬ ВТ_КоличествоСкладов
		|ИЗ
		|	РегистрНакопления.RMS_РезервыПодЗаказНаряд.ОстаткиИОбороты(
		|			,
		|			,
		|			Авто,
		|			,
		|			Номенклатура В (ВЫБРАТЬ Аналоги.НоменклатураАналог ИЗ ВТ_ВсеОригиналыАналоги КАК Аналоги)
		|				И Организация = &Организация) КАК RMS_РезервыПодЗаказНарядОстаткиИОбороты
		|ГДЕ
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// --- Инфостарт #5117 07.12.2021
		// Получение резервов товаров в разрезе оригиналов
		|ВЫБРАТЬ
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд КАК асЗаказНаряд,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд.Подразделение КАК Подразделение,
		|	ВТ_ВсеОригиналыАналоги.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница КАК СкладРезерва,
		|	ВЫБОР
		|		КОГДА RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СкладУчета,
		// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_КоличествоСкладов.КоличествоСкладов, 0) > 1
		|			ТОГДА RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК СвойСклад,
		// --- Инфостарт #5117 07.12.2021
		|	СУММА(ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстаткиИОбороты.КоличествоПриход, 0) - ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстаткиИОбороты.КоличествоРасход, 0)) КАК Количество,
		|	МИНИМУМ(RMS_РезервыПодЗаказНарядОстаткиИОбороты.Период) КАК ДатаРезерва
		|ПОМЕСТИТЬ ВТ_Резервы
		|ИЗ
		|	ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.ОстаткиИОбороты(
		|			,
		|			,
		|			Секунда,
		|			,
		|			Номенклатура В (ВЫБРАТЬ Аналоги.НоменклатураАналог ИЗ ВТ_ВсеОригиналыАналоги КАК Аналоги)
		|				И Организация = &Организация) КАК RMS_РезервыПодЗаказНарядОстаткиИОбороты
		// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСкладов КАК ВТ_КоличествоСкладов
		|			ПО RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд = ВТ_КоличествоСкладов.асЗаказНаряд
		|				И RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура = ВТ_КоличествоСкладов.Номенклатура
		// --- Инфостарт #5117 07.12.2021
		|		ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = RMS_РезервыПодЗаказНарядОстаткиИОбороты.Номенклатура
		|	
		|СГРУППИРОВАТЬ ПО
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.асЗаказНаряд.Подразделение,
		|	ВТ_ВсеОригиналыАналоги.Номенклатура,
		|	RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница,
		// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_КоличествоСкладов.КоличествоСкладов, 0) > 1
		|			ТОГДА RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		// --- Инфостарт #5117 07.12.2021
		|	ВЫБОР
		|		КОГДА RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ RMS_РезервыПодЗаказНарядОстаткиИОбороты.СтруктурнаяЕдиница
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстаткиИОбороты.КоличествоПриход, 0) - ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстаткиИОбороты.КоличествоРасход, 0)) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// Группировка номенклатуры с её оригиналами
		|ВЫБРАТЬ
		|	ВТ_НайденныеОригиналы.Номенклатура КАК Номенклатура,
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал КАК НоменклатураОригинал
		|ИЗ
		|	ВТ_НайденныеОригиналы КАК ВТ_НайденныеОригиналы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НайденныеОригиналы.Номенклатура,
		|	ВТ_НайденныеОригиналы.НоменклатураОригинал
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////// 
		// Получение давальческих складов по подразделениям
		|ВЫБРАТЬ
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
		|	КОНЕЦ КАК СкладДавальческогоСырья
		|ИЗ
		|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
		|
		|СГРУППИРОВАТЬ ПО
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение,
		|	ВЫБОР
		|		КОГДА дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////   
		// Получение остатков в разрезе оригиналов
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВТ_ВсеОригиналыАналоги.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ЗапасыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ИЗ
		|	ВТ_ВсеОригиналыАналоги КАК ВТ_ВсеОригиналыАналоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			,
		|			Номенклатура В (ВЫБРАТЬ Аналоги.НоменклатураАналог ИЗ ВТ_ВсеОригиналыАналоги КАК Аналоги)
		|				И Организация = &Организация) КАК ЗапасыНаСкладахОстатки
		|		ПО ВТ_ВсеОригиналыАналоги.НоменклатураАналог = ЗапасыНаСкладахОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеОригиналыАналоги.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.дмРаспределятьРезервЗапчастейНаСкладе
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Резервы.асЗаказНаряд КАК асЗаказНаряд,
		|	ВТ_Резервы.Подразделение КАК Подразделение,
		|	ВТ_Резервы.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	ВТ_Резервы.СкладУчета КАК СкладУчета,
		|	ВТ_Резервы.СкладРезерва КАК СкладРезерва,
		// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		|	ВТ_Резервы.СвойСклад КАК СвойСклад,
		// --- Инфостарт #5117 07.12.2021
		|	ВТ_Резервы.Количество КАК Количество,
		|	ВТ_Резервы.ДатаРезерва КАК ДатаРезерва
		|ИЗ
		|	ВТ_Резервы КАК ВТ_Резервы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРезерва
		|ИТОГИ ПО
		|	Номенклатура,
		|	Характеристика";
		// --- Инфостарт 19.11.2021
	
	Запрос.УстановитьПараметр("Организация",    Объект.Организация);
	Запрос.УстановитьПараметр("Номенклатура",   Объект.МатериалыЗаказчика.Выгрузить(, "Номенклатура"));
	Запрос.УстановитьПараметр("Характеристика", Объект.МатериалыЗаказчика.Выгрузить(, "Характеристика"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// +++ Инфостарт 19.11.2021 Добавление учета аналогов товаров
	//ТаблицаДавСкладов = РезультатЗапроса[1].Выгрузить();
	//ТаблицаОстатков   = РезультатЗапроса[2].Выгрузить();
	//ВыборкаТоваров    = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаОригиналов = РезультатЗапроса[РезультатЗапроса.Количество() - 4].Выгрузить();
	ТаблицаДавСкладов = РезультатЗапроса[РезультатЗапроса.Количество() - 3].Выгрузить();
	ТаблицаОстатков   = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выгрузить();
	ВыборкаТоваров    = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// --- Инфостарт 19.11.2021
	
	ПустойСклад = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
	// Перенос полученных данных в таблицу
	Пока ВыборкаТоваров.Следующий() Цикл
		
		ВыборкаХарактеристик = ВыборкаТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаХарактеристик.Следующий() Цикл
			
			ВыборкаРезервов = ВыборкаХарактеристик.Выбрать();
			
			Пока ВыборкаРезервов.Следующий() Цикл
				
				НоваяСтрока = РезервыНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезервов);
				НоваяСтрока.РезервТекущегоЗаказНаряда = "Ожидание наличия";
				
				ОтборДавСклада = Новый Структура("Подразделение", ВыборкаРезервов.Подразделение);
				НайденныеДавСклады = ТаблицаДавСкладов.НайтиСтроки(ОтборДавСклада);
				
				КоличествоРезерва = ВыборкаРезервов.Количество;
				
				// Обработка заказов, в которых к подразделению указаны давальческие склады (один или несколько)
				Если НайденныеДавСклады.Количество() > 0 И ВыборкаРезервов.СкладУчета <> ПустойСклад Тогда
					
					ЧастичноОтгружен = Ложь;
					
					Для Каждого ДавСклад Из НайденныеДавСклады Цикл
						
						ОтборОстатка = Новый Структура;
						ОтборОстатка.Вставить("СтруктурнаяЕдиница", ДавСклад.СкладДавальческогоСырья);
						ОтборОстатка.Вставить("Номенклатура",       ВыборкаТоваров.Номенклатура);
						ОтборОстатка.Вставить("Характеристика",     ВыборкаХарактеристик.Характеристика);
						НайденныеОстатки = ТаблицаОстатков.НайтиСтроки(ОтборОстатка);
						
						Если НайденныеОстатки.Количество() > 0 И КоличествоРезерва > 0 Тогда
							
							ОстатокНаСкладе = НайденныеОстатки[0].КоличествоОстаток;
							
							Если ОстатокНаСкладе >= КоличествоРезерва Тогда
								
								НайденныеОстатки[0].КоличествоОстаток = ОстатокНаСкладе - КоличествоРезерва;
								НоваяСтрока.РезервТекущегоЗаказНаряда = "Готов к выдаче";
								
								// +++ Инфостарт #2507 03.09.2021
								НоваяСтрока.Количество = 0;
								// --- Инфостарт #2507 03.09.2021
								
								КоличествоРезерва = 0;
								ЧастичноОтгружен = Истина;
								
							ИначеЕсли ОстатокНаСкладе < КоличествоРезерва И ОстатокНаСкладе > 0 Тогда
								
								НайденныеОстатки[0].КоличествоОстаток = 0;
								НоваяСтрока.РезервТекущегоЗаказНаряда = "Частично готов к выдаче";
								
								// +++ Инфостарт #2507 03.09.2021
								НоваяСтрока.Количество = КоличествоРезерва - ОстатокНаСкладе;
								// --- Инфостарт #2507 03.09.2021
								
								КоличествоРезерва = КоличествоРезерва - ОстатокНаСкладе;
								ЧастичноОтгружен = Истина;
								
							ИначеЕсли ОстатокНаСкладе <= 0 Тогда
								
								НоваяСтрока.РезервТекущегоЗаказНаряда = "Ожидание наличия";
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если НоваяСтрока.РезервТекущегоЗаказНаряда = "Ожидание наличия" И ЧастичноОтгружен Тогда
						НоваяСтрока.РезервТекущегоЗаказНаряда = "Частично готов к выдаче";
					КонецЕсли;
					
				// Обработка заказ-нарядов без давальческих складов
				Иначе
					
					ОтборОстатка = Новый Структура;
					ОтборОстатка.Вставить("СтруктурнаяЕдиница", ВыборкаРезервов.СкладУчета);
					ОтборОстатка.Вставить("Номенклатура",       ВыборкаТоваров.Номенклатура);
					ОтборОстатка.Вставить("Характеристика",     ВыборкаХарактеристик.Характеристика);
					НайденныеОстатки = ТаблицаОстатков.НайтиСтроки(ОтборОстатка);
					
					Если НайденныеОстатки.Количество() > 0 Тогда
						
						ОстатокНаСкладе = НайденныеОстатки[0].КоличествоОстаток;
						
						Если ОстатокНаСкладе >= ВыборкаРезервов.Количество Тогда
							
							НайденныеОстатки[0].КоличествоОстаток = ОстатокНаСкладе - ВыборкаРезервов.Количество;
							НоваяСтрока.РезервТекущегоЗаказНаряда = "Готов к выдаче";
							// +++ Инфостарт #2507 03.09.2021
							НоваяСтрока.Количество = 0;
							// --- Инфостарт #2507 03.09.2021
							
						ИначеЕсли ОстатокНаСкладе < ВыборкаРезервов.Количество И ОстатокНаСкладе > 0 Тогда
							
							НайденныеОстатки[0].КоличествоОстаток = 0;
							НоваяСтрока.РезервТекущегоЗаказНаряда = "Частично готов к выдаче";
							
							// +++ Инфостарт #2507 03.09.2021
							НоваяСтрока.Количество = ВыборкаРезервов.Количество - ОстатокНаСкладе;
							// --- Инфостарт #2507 03.09.2021
							
						ИначеЕсли ОстатокНаСкладе <= 0 Тогда
							
							НоваяСтрока.РезервТекущегоЗаказНаряда = "Ожидание наличия";
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// +++ Инфостарт #8008 21.01.2022 Установка статуса для нерезервируемых товаров
	ТоварыВПеремещениях = ТоварыВПеремещениях(Объект.Ссылка);
	// --- Инфостарт #8008 21.01.2022
	
	// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
	МассивУдаляемыхРезервов = Новый Массив;
	СтрокаСвоегоРезерва  = Неопределено;
	// --- Инфостарт #5117 07.12.2021
	
	// Заполнение колонки РезервТекущегоЗаказНаряда
	Для Каждого СтрокаМатериалов Из Объект.МатериалыЗаказчика Цикл
		
		// +++ Инфостарт #8008 21.01.2022 Установка статуса для выданных и возвращенных товаров
		ОтборВПеремещениях = Новый Структура;
		ОтборВПеремещениях.Вставить("Номенклатура",   СтрокаМатериалов.Номенклатура);
		ОтборВПеремещениях.Вставить("Характеристика", СтрокаМатериалов.Характеристика);
		
		СтрокиВПеремещениях = ТоварыВПеремещениях.НайтиСтроки(ОтборВПеремещениях);
		
		Если СтрокиВПеремещениях.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(СтрокиВПеремещениях[0].Статус) Тогда
				
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = СтрокиВПеремещениях[0].Статус;
				Продолжить;
				
			КонецЕсли;
		КонецЕсли;
		// --- Инфостарт #8008 21.01.2022
		
		СтрокаМатериалов.РезервТекущегоЗаказНаряда = "";
		
		// +++ Инфостарт 19.11.2021 Поиск оригинала товара
		ОригиналТовара = СтрокаМатериалов.Номенклатура;
		
		ОтборОригинала = Новый Структура("Номенклатура", СтрокаМатериалов.Номенклатура);
		НайденныйОригинал = ТаблицаОригиналов.НайтиСтроки(ОтборОригинала);
		
		Если НайденныйОригинал.Количество() > 0 И ЗначениеЗаполнено(НайденныйОригинал[0].НоменклатураОригинал) Тогда
			ОригиналТовара = НайденныйОригинал[0].НоменклатураОригинал;
		КонецЕсли;
		// --- Инфостарт 19.11.2021
		
		ОтборМатериала = Новый Структура;
		ОтборМатериала.Вставить("асЗаказНаряд",   Объект.Ссылка);
		// +++ Инфостарт 19.11.2021 Поиск по оригиналу товара
		//ОтборМатериала.Вставить("Номенклатура",   СтрокаМатериалов.Номенклатура);
		//ОтборМатериала.Вставить("Характеристика", СтрокаМатериалов.Характеристика);
		ОтборМатериала.Вставить("Номенклатура", ОригиналТовара);
		// --- Инфостарт 19.11.2021
		
		НайденныеРезервы = РезервыНоменклатуры.НайтиСтроки(ОтборМатериала);
		
		ПустойСкладГотов = Ложь;
		СвойСкладПустой  = Ложь;
		
		// +++ Инфостарт #2507 07.10.2021
		ПустойСкладНеГотов = Ложь;
		СвойСкладГотов     = Ложь;
		// --- Инфостарт #2507 07.10.2021
		
		// +++ Инфостарт 28.12.2021 Изменение логики статусов на своем и пустом складе
		ЕстьПустойСклад = Ложь;
		// --- Инфостарт 28.12.2021
		
		Для Каждого НайденныйРезерв Из НайденныеРезервы Цикл
			
			// +++ Инфостарт 28.12.2021 Изменение логики статусов на своем и пустом складе
			Если НайденныйРезерв.СкладРезерва = ПустойСклад Тогда
				ЕстьПустойСклад = Истина;
			КонецЕсли;
			// --- Инфостарт 28.12.2021
			
			Если НайденныйРезерв.РезервТекущегоЗаказНаряда = "Готов к выдаче"
					// +++ Инфостарт #2507 07.10.2021
					//И НайденныйРезерв.СкладУчета = ПустойСклад Тогда
					И НайденныйРезерв.СкладРезерва = ПустойСклад Тогда
					// --- Инфостарт #2507 07.10.2021
				ПустойСкладГотов = Истина;
			КонецЕсли; 
			
			Если НайденныйРезерв.РезервТекущегоЗаказНаряда = "Ожидание наличия"
					// +++ Инфостарт #2507 07.10.2021
					//И НайденныйРезерв.СкладУчета <> ПустойСклад Тогда
					И НайденныйРезерв.СкладРезерва <> ПустойСклад Тогда
					// --- Инфостарт #2507 07.10.2021
				СвойСкладПустой = Истина;
				// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
				СтрокаСвоегоРезерва = НайденныйРезерв;
				// --- Инфостарт #5117 07.12.2021
			КонецЕсли;
			
			// +++ Инфостарт #2507 07.10.2021
			Если (НайденныйРезерв.РезервТекущегоЗаказНаряда = "Ожидание наличия" 
					ИЛИ НайденныйРезерв.РезервТекущегоЗаказНаряда = "Частично готов к выдаче")
					И НайденныйРезерв.СкладРезерва = ПустойСклад Тогда
				ПустойСкладНеГотов = Истина;
			КонецЕсли;
			
			Если НайденныйРезерв.РезервТекущегоЗаказНаряда = "Готов к выдаче"
					И НайденныйРезерв.СкладРезерва <> ПустойСклад Тогда
				СвойСкладГотов = Истина;
			КонецЕсли;
			// --- Инфостарт #2507 07.10.2021
			
			Если НайденныйРезерв.РезервТекущегоЗаказНаряда = "Готов к выдаче"
					И НайденныйРезерв.СвойСклад // +++ Инфостарт #5117 07.12.2021
					И (СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидание наличия"
					ИЛИ СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Частично готов к выдаче") Тогда
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Частично готов к выдаче";
			ИначеЕсли (СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Готов к выдаче"
					ИЛИ СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Частично готов к выдаче")
					И НайденныйРезерв.СвойСклад // +++ Инфостарт #5117 07.12.2021
					И НайденныйРезерв.РезервТекущегоЗаказНаряда = "Ожидание наличия" Тогда
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Частично готов к выдаче"; 
			// +++ Инфостарт #5117 07.12.2021
			//Иначе
			ИначеЕсли НайденныйРезерв.СвойСклад Тогда
			// --- Инфостарт #5117 07.12.2021
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = НайденныйРезерв.РезервТекущегоЗаказНаряда;
			КонецЕсли;
			
		КонецЦикла;
		
		// +++ Инфостарт 28.12.2021 Изменение логики статусов на своем и пустом складе
		//Если ПустойСкладГотов И СвойСкладПустой Тогда
		//	СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидает отгрузки со складов СММ";
		//	
		//	// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
		//	СтрокаСвоегоРезерва.СвойСклад = Ложь;
		//	// --- Инфостарт #5117 07.12.2021
		//КонецЕсли;
		Если СвойСкладПустой Тогда
			Если ЕстьПустойСклад Тогда
				Если ПустойСкладГотов Тогда
					
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидает отгрузки со складов СММ";
					СтрокаСвоегоРезерва.СвойСклад = Ложь;
					
				ИначеЕсли ПустойСкладНеГотов Тогда
					
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидание наличия";
					
				КонецЕсли;
				
			// Проверка свободного остатка на пустом складе
			Иначе
				
				ОстатокНаСкладе = 0;
				
				ОтборСвобОстатка = Новый Структура;
				ОтборСвобОстатка.Вставить("СтруктурнаяЕдиница", ПустойСклад);
				ОтборСвобОстатка.Вставить("Номенклатура",       ОригиналТовара);
				НайденныеСвобОстатки = ТаблицаОстатков.НайтиСтроки(ОтборСвобОстатка);
				
				Если НайденныеСвобОстатки.Количество() > 0 Тогда
					ОстатокНаСкладе = НайденныеСвобОстатки[0].КоличествоОстаток;
				КонецЕсли;
				
				Если ОстатокНаСкладе >= СтрокаСвоегоРезерва.Количество Тогда
					
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидает отгрузки со складов СММ";
					СтрокаСвоегоРезерва.СвойСклад = Ложь;
					
				Иначе
					
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Ожидание наличия";
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		// --- Инфостарт 28.12.2021
		
		// +++ Инфостарт #2507 07.10.2021
		Если ПустойСкладНеГотов И СвойСкладГотов Тогда
			СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Готов к выдаче";
		КонецЕсли;
		// --- Инфостарт #2507 07.10.2021
		
		// +++ Инфостарт #8008 21.01.2022 Установка статуса для нерезервируемых товаров
		Если СтрокаМатериалов.Номенклатура.дмНеУчаствуетВРезервах И СтрокаМатериалов.КоличествоВыдано = 0 Тогда
			Если СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Готов к выдаче" Тогда
				
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков на складе достаточно для получения";
				
			ИначеЕсли СтрокаМатериалов.РезервТекущегоЗаказНаряда = "" Тогда
				
				ОтборБезРезерва = Новый Структура("Номенклатура", СтрокаМатериалов.Номенклатура);
				СтрокиБезРезерва = ОстаткиТоваровБезРезерва.НайтиСтроки(ОтборБезРезерва);
				
				Если СтрокиБезРезерва.Количество() > 0 И СтрокиБезРезерва[0].ОстатокНаСкладе >= СтрокаМатериалов.Количество Тогда
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков на складе достаточно для получения";
				Иначе
					СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков недостаточно для получения";
				КонецЕсли;
				
			Иначе
				
				СтрокаМатериалов.РезервТекущегоЗаказНаряда = "Не резервируется. Остатков недостаточно для получения";
				
			КонецЕсли;
		КонецЕсли;
		// --- Инфостарт #8008 21.01.2022
		
	КонецЦикла;
	// --- Инфостарт #2507 26.08.2021
	
	// +++ Инфостарт #5117 07.12.2021 Устранение ошибки отсутствия статуса "Ожидание отгрузки со складов СММ"
	Для Каждого СтрокаРезерва Из РезервыНоменклатуры Цикл
		Если НЕ СтрокаРезерва.СвойСклад Тогда
			МассивУдаляемыхРезервов.Добавить(СтрокаРезерва);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйРезерв Из МассивУдаляемыхРезервов Цикл
		РезервыНоменклатуры.Удалить(УдаляемыйРезерв);
	КонецЦикла;
	// --- Инфостарт #5117 07.12.2021
	
КонецПроцедуры

