&НаСервере
Процедура ЗапуститьПроизводствоСервер(ВыбСклад)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	асЗаказНарядЗапасы.Номенклатура КАК Номенклатура,
	               |	СУММА(асЗаказНарядЗапасы.Количество) КАК Количество,
	               |	асЗаказНарядЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	асЗаказНарядЗапасы.Характеристика КАК Характеристика,
	               |	асЗаказНарядЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	асЗаказНарядЗапасы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ПромДанныеЗН
	               |ИЗ
	               |	Документ.асЗаказНаряд.Запасы КАК асЗаказНарядЗапасы
	               |ГДЕ
	               |	асЗаказНарядЗапасы.Ссылка = &Ссылка
	               |	И (асЗаказНарядЗапасы.Номенклатура.Родитель.Наименование = ""ЛКМ""
	               |			ИЛИ асЗаказНарядЗапасы.Номенклатура.Родитель.Наименование = ""Шиномонтаж"")
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	асЗаказНарядЗапасы.Номенклатура,
	               |	асЗаказНарядЗапасы.ЕдиницаИзмерения,
	               |	асЗаказНарядЗапасы.Характеристика,
	               |	асЗаказНарядЗапасы.Номенклатура.ТипНоменклатуры,
	               |	асЗаказНарядЗапасы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд) КАК ЗаказНарядОснование,
	               |	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	               |	СУММА(ПеремещениеЗапасовЗапасы.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ПеремещенияПоЗаказНаряду
	               |ИЗ
	               |	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд), ПеремещениеЗапасовЗапасы.Номенклатура) В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПромДанныеЗН.Ссылка,
	               |				ВТ_ПромДанныеЗН.Номенклатура
	               |			ИЗ
	               |				ВТ_ПромДанныеЗН)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд),
	               |	ПеремещениеЗапасовЗапасы.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПромДанныеЗН.Номенклатура КАК Номенклатура,
	               |	ВТ_ПромДанныеЗН.Количество - ЕСТЬNULL(ВТ_ПеремещенияПоЗаказНаряду.Количество, 0) КАК Количество,
	               |	ВТ_ПромДанныеЗН.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ПромДанныеЗН.Характеристика КАК Характеристика,
	               |	ВТ_ПромДанныеЗН.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	ВТ_ПромДанныеЗН.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДанныеЗН
	               |ИЗ
	               |	ВТ_ПромДанныеЗН КАК ВТ_ПромДанныеЗН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПеремещенияПоЗаказНаряду КАК ВТ_ПеремещенияПоЗаказНаряду
	               |		ПО ВТ_ПромДанныеЗН.Ссылка = ВТ_ПеремещенияПоЗаказНаряду.ЗаказНарядОснование
	               |			И ВТ_ПромДанныеЗН.Номенклатура = ВТ_ПеремещенияПоЗаказНаряду.Номенклатура
	               |ГДЕ
	               |	ВТ_ПромДанныеЗН.Количество - ЕСТЬNULL(ВТ_ПеремещенияПоЗаказНаряду.Количество, 0) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпецификацииСостав.Ссылка.Владелец КАК ПродукцияЛКМ,
	               |	СпецификацииСостав.Номенклатура КАК Запчасть
	               |ПОМЕСТИТЬ ВТ_ЗапчастиПоЛКМ
	               |ИЗ
	               |	Справочник.Спецификации.Состав КАК СпецификацииСостав
	               |ГДЕ
	               |	СпецификацииСостав.Ссылка.Владелец В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДанныеЗН.Номенклатура
	               |			ИЗ
	               |				ВТ_ДанныеЗН)
	               |	И (СпецификацииСостав.Номенклатура.Родитель.Наименование = ""автозапчасти""
	               |			ИЛИ СпецификацииСостав.Номенклатура.Родитель.Родитель.Наименование = ""Шиномонтаж"")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток - ВЫБОР
	               |		КОГДА ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0) < 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0)
	               |	КОНЕЦ КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	               |			&Дата,
	               |			НЕ СтруктурнаяЕдиница.асПроизводственный
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТ_ДанныеЗН.Номенклатура
	               |					ИЗ
	               |						ВТ_ДанныеЗН)
	               |				И СтруктурнаяЕдиница = &ВыбСклад) КАК ЗапасыНаСкладахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
	               |				&Дата,
	               |				НЕ СтруктурнаяЕдиница.асПроизводственный
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_ДанныеЗН.Номенклатура
	               |						ИЗ
	               |							ВТ_ДанныеЗН)
	               |					И НЕ асЗаказНаряд = &ЗаказНаряд
	               |					И СтруктурнаяЕдиница = &ВыбСклад) КАК RMS_РезервыПодЗаказНарядОстатки
	               |		ПО ЗапасыНаСкладахОстатки.Номенклатура = RMS_РезервыПодЗаказНарядОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток - ВЫБОР
	               |		КОГДА ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0) < 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0)
	               |	КОНЕЦ КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиЗапчастей
	               |ИЗ
	               |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	               |			&Дата,
	               |			НЕ СтруктурнаяЕдиница.асПроизводственный
	               |				И Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТ_ЗапчастиПоЛКМ.Запчасть
	               |					ИЗ
	               |						ВТ_ЗапчастиПоЛКМ)
	               |				И СтруктурнаяЕдиница = &ВыбСклад) КАК ЗапасыНаСкладахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
	               |				&Дата,
	               |				НЕ СтруктурнаяЕдиница.асПроизводственный
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_ЗапчастиПоЛКМ.Запчасть
	               |						ИЗ
	               |							ВТ_ЗапчастиПоЛКМ)
	               |					И НЕ асЗаказНаряд = &ЗаказНаряд
	               |					И СтруктурнаяЕдиница = &ВыбСклад) КАК RMS_РезервыПодЗаказНарядОстатки
	               |		ПО ЗапасыНаСкладахОстатки.Номенклатура = RMS_РезервыПодЗаказНарядОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗапчастиПоЛКМ.ПродукцияЛКМ КАК ПродукцияЛКМ,
	               |	ВТ_ЗапчастиПоЛКМ.Запчасть КАК Запчасть,
	               |	ЕСТЬNULL(ВТ_ОстаткиЗапчастей.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_ЛКМ_ОстаткиЗапчастей
	               |ИЗ
	               |	ВТ_ЗапчастиПоЛКМ КАК ВТ_ЗапчастиПоЛКМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиЗапчастей КАК ВТ_ОстаткиЗапчастей
	               |		ПО ВТ_ЗапчастиПоЛКМ.Запчасть = ВТ_ОстаткиЗапчастей.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказНаПроизводствоПродукция.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказНаПроизводствоПродукция.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ВыполненныеЗаказыНаПрво
	               |ИЗ
	               |	Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция
	               |ГДЕ
	               |	(ЗаказНаПроизводствоПродукция.Номенклатура, ЗаказНаПроизводствоПродукция.Ссылка.ДокументОснование) В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДанныеЗН.Номенклатура,
	               |				ВТ_ДанныеЗН.Ссылка
	               |			ИЗ
	               |				ВТ_ДанныеЗН)
	               |	И ЗаказНаПроизводствоПродукция.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказНаПроизводствоПродукция.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеЗН.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеЗН.Количество КАК Количество,
	               |	ВТ_ДанныеЗН.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ДанныеЗН.Характеристика КАК Характеристика,
	               |	ВТ_ДанныеЗН.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	ВТ_ДанныеЗН КАК ВТ_ДанныеЗН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	               |		ПО ВТ_ДанныеЗН.Номенклатура = ВТ_Остатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполненныеЗаказыНаПрво КАК ВТ_ВыполненныеЗаказыНаПрво
	               |		ПО ВТ_ДанныеЗН.Номенклатура = ВТ_ВыполненныеЗаказыНаПрво.Номенклатура
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ЭтоШиномонтаж
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВТ_ДанныеЗН.Количество > ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0)
	               |		КОНЕЦ
	               |	И ВТ_ДанныеЗН.Количество <> ЕСТЬNULL(ВТ_ВыполненныеЗаказыНаПрво.Количество, 0)";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЗаказНаряд", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВыбСклад", ВыбСклад);
	Запрос.УстановитьПараметр("ЭтоШиномонтаж", Объект.ВидРемонта.Код = "000000012");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщить("Нет позиций на производство.");
		Возврат;
	КонецЕсли;
	ВыборкаПозицийДляПроизводства = Результат.Выбрать();
	СоздатьЗаказНаПроизводство(ВыборкаПозицийДляПроизводства, ВыбСклад, Перечисления.ВидыОперацийЗаказНаПроизводство.Сборка);
КонецПроцедуры

