Процедура ЗапомнитьДвиженияПриходВРаботе(Отказ, РежимПроведения)
			
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ЭтотОбъект.ДополнительныеСвойства.RMS_МенеджерВТ;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Резервы.Период КАК Период,
	|	Резервы.Регистратор КАК Регистратор,
	|	Резервы.Активность КАК Активность,
	|	Резервы.ВидДвижения КАК ВидДвижения,
	|	Резервы.Организация КАК Организация,
	|	Резервы.Номенклатура КАК Номенклатура,
	|	Резервы.Характеристика КАК Характеристика,
	|	Резервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Резервы.асЗаказНаряд КАК асЗаказНаряд,
	|	Резервы.Количество КАК Количество
	|ПОМЕСТИТЬ РезервыПриход
	|ИЗ
	|	РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК Резервы
	|ГДЕ
	|	Резервы.Регистратор = &Регистратор
	|	И Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";

	Запрос.Выполнить();
	
КонецПроцедуры
