// +++ Инфостарт # 2666 02.08.2021
Процедура ЗапомнитьДвиженияРезервыВРаботе(Отказ, РежимПроведения) // BSLLS-off
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ЭтотОбъект.ДополнительныеСвойства.RMS_МенеджерВТ;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Резервы.Период КАК Период,
	|	Резервы.Регистратор КАК Регистратор,
	|	Резервы.Активность КАК Активность,
	|	Резервы.ВидДвижения КАК ВидДвижения,
	|	Резервы.Организация КАК Организация,
	|	Резервы.Номенклатура КАК Номенклатура,
	|	Резервы.Характеристика КАК Характеристика,
	|	Резервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Резервы.асЗаказНаряд КАК асЗаказНаряд,
	|	Резервы.Количество КАК Количество
	|ПОМЕСТИТЬ РезервыПрошлые
	|ИЗ
	|	РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК Резервы
	|ГДЕ
	|	Резервы.Регистратор = &Регистратор";
	
	Запрос.Выполнить();
	
КонецПроцедуры
// --- Инфостарт # 2666 02.08.2021
