Процедура СформироватьДвиженияВРаботе(Отказ, РежимПроведения)
	
	// +++ Инфостарт #5223 12.11.2021
	Если дмТотал Тогда
		
		Движения.RMS_РезервыПодЗаказНаряд.Очистить();
		Движения.RMS_РезервыПодЗаказНаряд.Записать();
		Возврат;
		
	КонецЕсли;
	// --- Инфостарт #5223 12.11.2021
	
	// Делаем движения-приход.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период",      ЭтотОбъект.Дата);
	
	// +++ Инфостарт #6915 17.12.2021
	ДопРеквизитТовара = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Плановое пополнение запасов на складах");
	Запрос.УстановитьПараметр("ДопРеквизитТовара", ДопРеквизитТовара);
	// --- Инфостарт #6915 17.12.2021
	
	Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Подразделение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка.Дата КАК Период,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Ссылка.RMS_СкладХраненияЗапасов КАК СтруктурнаяЕдиница,
	|	Док.Ссылка КАК Ссылка,
	|	СУММА(Док.Количество) КАК Количество
	|ПОМЕСТИТЬ ЗаказНаряд
	|ИЗ
	|	Документ.асЗаказНаряд.МатериалыЗаказчика КАК Док
	|ГДЕ
	|	Док.Ссылка = &Регистратор
	// +++ Инфостарт #3886 02.09.2021
	|		И Док.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
	// --- Инфостарт #3886 02.09.2021
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка.Дата,
	|	Док.Ссылка,
	|	Док.Номенклатура,
	|	Док.Характеристика,
	|	Док.Ссылка.Организация,
	|	Док.Ссылка.RMS_СкладХраненияЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья КАК СкладДавальческогоСырья
	|ПОМЕСТИТЬ ВТСкладыДС
	|ИЗ
	|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
	|ГДЕ
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика,
	|	СУММА(Т.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Ост
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.Номенклатура КАК Номенклатура,
	|		Остатки.Характеристика КАК Характеристика,
	|		Остатки.Организация КАК Организация,
	|		Остатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Остатки.КоличествоОстаток КАК КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|				,
	|				(Номенклатура, Характеристика, Организация) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Т.Номенклатура КАК Номенклатура,
	|						Т.Характеристика КАК Характеристика,
	|						Т.Организация КАК Организация
	|					ИЗ
	|						ЗаказНаряд КАК Т)
	|					И СтруктурнаяЕдиница В (ВЫБРАТЬ
	|						ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
	|					ИЗ
	|						ВТСкладыДС КАК ВТСкладыДС)) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Резервы.Номенклатура,
	|		Резервы.Характеристика,
	|		Резервы.Организация,
	|		Резервы.СтруктурнаяЕдиница,
	|		ВЫБОР
	|			КОГДА Резервы.КоличествоОстаток > 0
	|				ТОГДА -Резервы.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
	|				,
	|				асЗаказНаряд <> &Регистратор
	|					И (Номенклатура, Характеристика, Организация) В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Т.Номенклатура КАК Номенклатура,
	|							Т.Характеристика КАК Характеристика,
	|							Т.Организация КАК Организация
	|						ИЗ
	|							ЗаказНаряд КАК Т)
	|						И СтруктурнаяЕдиница В (ВЫБРАТЬ
	|							ВТСкладыДС.СкладДавальческогоСырья КАК СкладДавальческогоСырья
	|						ИЗ
	|							ВТСкладыДС КАК ВТСкладыДС)) КАК Резервы) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.СтруктурнаяЕдиница,
	|	Т.Номенклатура,
	|	Т.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// +++ Инфостарт #6915 17.12.2021
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК СтрокаОбработана
	|ПОМЕСТИТЬ ВТ_ПлановыеЗапасы
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитТовара
	|	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураДополнительныеРеквизиты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТСкладыДС.СкладДавальческогоСырья) КАК СкладДавальческогоСырья
	|ПОМЕСТИТЬ ВТ_ПлановыйСкладДС
	|ИЗ
	|	ВТСкладыДС КАК ВТСкладыДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// --- Инфостарт #6915 17.12.2021
	|ВЫБРАТЬ
	|	Док.Период КАК Период,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	Док.Организация КАК Организация,
	// +++ Инфостарт #2666 13.08.2021
	|	Док.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаДок,
	// --- Инфостарт #2666 13.08.2021
	|	Ост.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Док.Количество КАК КоличествоТребуется,
	|	Док.Количество КАК КоличествоЗарезервировать,
	|	ЕСТЬNULL(Ост.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ПОМЕСТИТЬ Резерв
	|ИЗ
	|	ЗаказНаряд КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ост КАК Ост
	|		ПО Док.Номенклатура = Ост.Номенклатура
	|			И Док.Характеристика = Ост.Характеристика
	|			И Док.Организация = Ост.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// +++ Инфостарт #6915 17.12.2021
	//|ВЫБРАТЬ
	//|	Р.Период КАК Период,
	//|	Р.Ссылка КАК Регистратор,
	//|	ИСТИНА КАК Активность,
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	Р.Номенклатура КАК Номенклатура,
	//|	Р.Характеристика КАК Характеристика,
	//|	Р.Организация КАК Организация,
	//// +++ Инфостарт #2666 13.08.2021
	////|	Р.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	//|	Р.СтруктурнаяЕдиницаДок КАК СтруктурнаяЕдиница,
	//// --- Инфостарт #2666 13.08.2021
	//|	Р.Ссылка КАК асЗаказНаряд,
	//|	Р.КоличествоЗарезервировать КАК Количество,
	//|	ЛОЖЬ КАК СтрокаОбработана
	//|ИЗ
	//|	Резерв КАК Р
	//|ГДЕ
	//|	Р.КоличествоЗарезервировать > 0
	//|	И Р.КоличествоОстаток > 0
	//|
	//// +++ Инфостарт #2666 13.08.2021
	//|СГРУППИРОВАТЬ ПО
	//|	Р.Период,
	//|	Р.Ссылка,
	//|	Р.Номенклатура,
	//|	Р.Характеристика,
	//|	Р.Организация,
	//|	Р.СтруктурнаяЕдиницаДок,
	//|	Р.КоличествоЗарезервировать,
	//|	Р.Ссылка
	//// --- Инфостарт #2666 13.08.2021
	|ВЫБРАТЬ
	|	Р.Период КАК Период,
	|	Р.Ссылка КАК Регистратор,
	|	ИСТИНА КАК Активность,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Характеристика КАК Характеристика,
	|	Р.Организация КАК Организация,
	|	ВЫБОР
	// +++ Инфостарт 29.12.2021 Формирование резервов на давальческом складе
	//|		КОГДА ЕСТЬNULL(ВТ_ПлановыеЗапасы.СтрокаОбработана, ЛОЖЬ) = ИСТИНА
	//|				И ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		КОГДА ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	// --- Инфостарт 29.12.2021
	|			ТОГДА ВТ_ПлановыйСкладДС.СкладДавальческогоСырья
	|		ИНАЧЕ Р.СтруктурнаяЕдиницаДок
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	Р.Ссылка КАК асЗаказНаряд,
	|	Р.КоличествоЗарезервировать КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ПлановыеЗапасы.СтрокаОбработана, ЛОЖЬ) = ИСТИНА
	|				И ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтрокаОбработана
	|ИЗ
	|	Резерв КАК Р
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеЗапасы КАК ВТ_ПлановыеЗапасы
	|		ПО Р.Номенклатура = ВТ_ПлановыеЗапасы.Номенклатура,
	|	ВТ_ПлановыйСкладДС КАК ВТ_ПлановыйСкладДС
	|ГДЕ
	|	Р.КоличествоЗарезервировать > 0
	|	И (Р.КоличествоОстаток > 0
	|			ИЛИ ЕСТЬNULL(ВТ_ПлановыеЗапасы.СтрокаОбработана, ЛОЖЬ) = ИСТИНА
	|				И ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Р.Период,
	|	Р.Ссылка,
	|	Р.Номенклатура,
	|	Р.Характеристика,
	|	Р.Организация,
	|	ВЫБОР
	// +++ Инфостарт 29.12.2021 Формирование резервов на давальческом складе
	//|		КОГДА ЕСТЬNULL(ВТ_ПлановыеЗапасы.СтрокаОбработана, ЛОЖЬ) = ИСТИНА
	//|				И ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		КОГДА ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	// --- Инфостарт 29.12.2021
	|			ТОГДА ВТ_ПлановыйСкладДС.СкладДавальческогоСырья
	|		ИНАЧЕ Р.СтруктурнаяЕдиницаДок
	|	КОНЕЦ,
	|	Р.КоличествоЗарезервировать,
	|	Р.Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ПлановыеЗапасы.СтрокаОбработана, ЛОЖЬ) = ИСТИНА
	|				И ЕСТЬNULL(ВТ_ПлановыйСкладДС.СкладДавальческогоСырья, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	// --- Инфостарт #6915 17.12.2021
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Р.Организация КАК Организация,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Характеристика КАК Характеристика,
	|	Р.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Р.КоличествоЗарезервировать КАК Количество,
	|	Р.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	Резерв КАК Р
	|ГДЕ
	|	Р.КоличествоЗарезервировать > 0
	|	И Р.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	Характеристика,
	|	КоличествоОстаток УБЫВ
	|ИТОГИ ПО
	|	Организация,
	|	Номенклатура,
	|	Характеристика";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ДвиженияРезервы = МассивРезультатов[МассивРезультатов.Количество() - 2].Выгрузить();
	// Заполнение таблицы с учетом распределения товаров по ячейкам
	ВыборкаОрганизация = МассивРезультатов[МассивРезультатов.Количество() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаНоменклатура = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаХарактеристика.Следующий() Цикл
				
				ВыборкаДЗ = ВыборкаХарактеристика.Выбрать();
				
				Пока ВыборкаДЗ.Следующий() Цикл
					
					ОтборСтрок = Новый Структура("Организация,Номенклатура,Характеристика,СтрокаОбработана",
									ВыборкаОрганизация.Организация,
									ВыборкаНоменклатура.Номенклатура,
									ВыборкаХарактеристика.Характеристика,
									Ложь);
					
					МассивСтрок = ДвиженияРезервы.НайтиСтроки(ОтборСтрок);
					
					ТекКоличество = ВыборкаДЗ.КоличествоОстаток;
					
					Для Каждого Стр Из МассивСтрок Цикл
						Если ТекКоличество >= Стр.Количество Тогда
							
							Стр.СтрокаОбработана = Истина;
							
							// +++ Инфостарт #2666 13.08.2021
							Стр.СтруктурнаяЕдиница = ВыборкаДЗ.СтруктурнаяЕдиница;
							// --- Инфостарт #2666 13.08.2021
							
							ТекКоличество = ТекКоличество - Стр.Количество;
							
						ИначеЕсли ТекКоличество < Стр.Количество И ТекКоличество > 0 Тогда
							
							// Копирование строки с остатком количества
							НоваяСтрока = ДвиженияРезервы.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
							
							Стр.СтрокаОбработана = Истина;
							Стр.Количество       = ТекКоличество;
							
							// +++ Инфостарт #2666 13.08.2021
							Стр.СтруктурнаяЕдиница = ВыборкаДЗ.СтруктурнаяЕдиница;
							// --- Инфостарт #2666 13.08.2021
							
							НоваяСтрока.Количество       = НоваяСтрока.Количество - ТекКоличество;
							НоваяСтрока.СтрокаОбработана = Ложь;
							
							ТекКоличество = 0;
							
							ДвиженияРезервы.Сортировать("Организация,Номенклатура,Характеристика");
							
						КонецЕсли;
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДвиженияРезервы.Сортировать("Организация,Номенклатура,Характеристика");
	
	// Удаление необработанных строк
	МассивСтрокЗапасов = Новый Массив;
	
	Для Каждого СтрокаЗапасов Из ДвиженияРезервы Цикл
		Если НЕ СтрокаЗапасов.СтрокаОбработана Тогда
			МассивСтрокЗапасов.Добавить(СтрокаЗапасов);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Эл Из МассивСтрокЗапасов Цикл
		ДвиженияРезервы.Удалить(Эл);
	КонецЦикла;
	
	// +++ Инфостарт #2666 02.08.2021
	// Необходимо сравнить и объединить сформированные движения с имеющимися ранее для сохранения движений и дат передачи
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ЭтотОбъект.ДополнительныеСвойства.RMS_МенеджерВТ;
	Запрос.УстановитьПараметр("Регистратор",     ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период",          ТекущаяДата());
	Запрос.УстановитьПараметр("ТаблицаРезервов", ДвиженияРезервы);
	
	// +++ Инфостарт #8008 25.01.2022
	Запрос.УстановитьПараметр("СписокМатериалов", МатериалыЗаказчика.ВыгрузитьКолонку("Номенклатура"));
	// --- Инфостарт #8008 25.01.2022
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРезервов.Период КАК Период,
	|	ТаблицаРезервов.Регистратор КАК Регистратор,
	|	ТаблицаРезервов.Активность КАК Активность,
	|	ТаблицаРезервов.ВидДвижения КАК ВидДвижения,
	|	ТаблицаРезервов.Номенклатура КАК Номенклатура,
	|	ТаблицаРезервов.Характеристика КАК Характеристика,
	|	ТаблицаРезервов.Организация КАК Организация,
	|	ТаблицаРезервов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаРезервов.асЗаказНаряд КАК асЗаказНаряд,
	|	ТаблицаРезервов.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПолученныеРезервы
	|ИЗ
	|	&ТаблицаРезервов КАК ТаблицаРезервов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПолученныеРезервы.Организация КАК Организация,
	|	ВТПолученныеРезервы.Номенклатура КАК Номенклатура,
	|	ВТПолученныеРезервы.Характеристика КАК Характеристика,
	|	ВТПолученныеРезервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТПолученныеРезервы.Количество КАК Количество
	|ПОМЕСТИТЬ ВТВсеРезервы
	|ИЗ
	|	ВТПолученныеРезервы КАК ВТПолученныеРезервы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыПрошлые.Организация,
	|	РезервыПрошлые.Номенклатура,
	|	РезервыПрошлые.Характеристика,
	|	РезервыПрошлые.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА РезервыПрошлые.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1 * РезервыПрошлые.Количество
	|		ИНАЧЕ РезервыПрошлые.Количество
	|	КОНЕЦ
	|ИЗ
	|	РезервыПрошлые КАК РезервыПрошлые
	// +++ Инфостарт #8008 25.01.2022
	// Нерезервируемые товары отбрасываются, чтобы сохранить приходы, созданные программно при смене статуса обработкой
	// Проверка наличия товара в ЗН нужна для снятия резервов по удаленным из документа товарам
	|ГДЕ
	|	РезервыПрошлые.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
	|		ИЛИ НЕ РезервыПрошлые.Номенклатура В (&СписокМатериалов)
	// --- Инфостарт #8008 25.01.2022
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВсеРезервы.Организация КАК Организация,
	|	ВТВсеРезервы.Номенклатура КАК Номенклатура,
	|	ВТВсеРезервы.Характеристика КАК Характеристика,
	|	ВТВсеРезервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ВТВсеРезервы.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТВсеРезервыСгруппированные
	|ИЗ
	|	ВТВсеРезервы КАК ВТВсеРезервы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВсеРезервы.Организация,
	|	ВТВсеРезервы.Номенклатура,
	|	ВТВсеРезервы.Характеристика,
	|	ВТВсеРезервы.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыПрошлые.Период КАК Период,
	|	РезервыПрошлые.ВидДвижения КАК ВидДвижения,
	|	РезервыПрошлые.Регистратор КАК Регистратор,
	|	РезервыПрошлые.Организация КАК Организация,
	|	РезервыПрошлые.Номенклатура КАК Номенклатура,
	|	РезервыПрошлые.Характеристика КАК Характеристика,
	|	РезервыПрошлые.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	РезервыПрошлые.асЗаказНаряд КАК асЗаказНаряд,
	|	РезервыПрошлые.Количество КАК Количество
	|ПОМЕСТИТЬ ВТНовыеДвижения
	|ИЗ
	|	РезервыПрошлые КАК РезервыПрошлые
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ВЫБОР
	|		КОГДА ВТВсеРезервыСгруппированные.Количество > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	&Регистратор,
	|	ВТВсеРезервыСгруппированные.Организация,
	|	ВТВсеРезервыСгруппированные.Номенклатура,
	|	ВТВсеРезервыСгруппированные.Характеристика,
	|	ВТВсеРезервыСгруппированные.СтруктурнаяЕдиница,
	|	&Регистратор,
	|	ВЫБОР
	|		КОГДА ВТВсеРезервыСгруппированные.Количество > 0
	|			ТОГДА ВТВсеРезервыСгруппированные.Количество
	|		ИНАЧЕ -1 * ВТВсеРезервыСгруппированные.Количество
	|	КОНЕЦ
	|ИЗ
	|	ВТВсеРезервыСгруппированные КАК ВТВсеРезервыСгруппированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНовыеДвижения.Период КАК Период,
	|	ВТНовыеДвижения.ВидДвижения КАК ВидДвижения,
	|	ВТНовыеДвижения.Регистратор КАК Регистратор,
	|	ВТНовыеДвижения.Организация КАК Организация,
	|	ВТНовыеДвижения.Номенклатура КАК Номенклатура,
	|	ВТНовыеДвижения.Характеристика КАК Характеристика,
	|	ВТНовыеДвижения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТНовыеДвижения.асЗаказНаряд КАК асЗаказНаряд,
	|	ВТНовыеДвижения.Количество КАК Количество
	|ИЗ
	|	ВТНовыеДвижения КАК ВТНовыеДвижения
	|ГДЕ
	|	ВТНовыеДвижения.Количество <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДвиженияРезервы = РезультатЗапроса.Выгрузить();
	// --- Инфостарт # 2666 02.08.2021
	
	Движения.RMS_РезервыПодЗаказНаряд.Записывать = Истина;
	Движения.RMS_РезервыПодЗаказНаряд.Загрузить(ДвиженияРезервы);
	// --- Инфостарт #1377 17.06.2021
	
КонецПроцедуры
