&Вместо("ИнициализироватьДанныеДокумента")
Процедура RMS_ИнициализироватьДанныеДокумента(ДокументСсылкаЗаказПоставщику, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуЗапасы.Количество
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Количество * ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ЗаказПоставщикуЗапасы.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
	|	И НЕ ЗаказПоставщикуЗапасы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуМатериалы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуМатериалы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Отгрузка) КАК ТипДвижения,
	|	ВЫБОР
	|		КОГДА Константы.ФункциональнаяОпцияРезервированиеЗапасов
	|			ТОГДА ЗаказПоставщикуМатериалы.Ссылка.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗаказПоставщикуМатериалы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуМатериалы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуМатериалы.Количество
	|		ИНАЧЕ ЗаказПоставщикуМатериалы.Количество * ЗаказПоставщикуМатериалы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Материалы КАК ЗаказПоставщикуМатериалы,
	|	Константы КАК Константы
	|ГДЕ
	|	ЗаказПоставщикуМатериалы.Ссылка = &Ссылка
	|	И ЗаказПоставщикуМатериалы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку)
	|	И НЕ ЗаказПоставщикуМатериалы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.ДатаПоступления КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Поступление) КАК ТипДвижения,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК Заказ,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуЗапасы.Количество
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Количество * ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
	|	И НЕ ЗаказПоставщикуЗапасы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗаказПоставщикуЗапасы.НомерСтроки,
	|	ЗаказПоставщикуЗапасы.ДатаОтгрузки,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДвиженийЗапасов.Отгрузка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаказПоставщикуЗапасы.Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуЗапасы.Количество
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Количество * ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказПоставщику.Материалы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
	|	И ЗаказПоставщикуЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку)
	|	И НЕ ЗаказПоставщикуЗапасы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуЗапасы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Константы.ФункциональнаяОпцияРезервированиеЗапасов
	|			ТОГДА ЗаказПоставщикуЗапасы.Ссылка.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуЗапасы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК ИсточникОбеспечения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуЗапасы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуЗапасы.Количество
	|		ИНАЧЕ ЗаказПоставщикуЗапасы.Количество * ЗаказПоставщикуЗапасы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы,
	|	Константы КАК Константы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
	|	И ЗаказПоставщикуЗапасы.Ссылка.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.Пустаяссылка)
	|	И Константы.ФункциональнаяОпцияРезервированиеЗапасов
	|	И НЕ ЗаказПоставщикуЗапасы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуЗапасы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуМатериалы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуМатериалы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	ЗаказПоставщикуМатериалы.Ссылка.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиница,
	|	ЗаказПоставщикуМатериалы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|	ЗаказПоставщикуМатериалы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ЗаказПоставщикуМатериалы.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА Константы.ФункциональнаяОпцияРезервированиеЗапасов
	|			ТОГДА ЗаказПоставщикуМатериалы.Ссылка.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК КоррЗаказПокупателя,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказПоставщикуМатериалы.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ЗаказПоставщикуМатериалы.Резерв
	|		ИНАЧЕ ЗаказПоставщикуМатериалы.Резерв * ЗаказПоставщикуМатериалы.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	0 КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий,
	|	&РезервированиеЗапасов КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ЗаказПоставщику.Материалы КАК ЗаказПоставщикуМатериалы,
	|	Константы КАК Константы
	|ГДЕ
	|	ЗаказПоставщикуМатериалы.Ссылка = &Ссылка
	|	И ЗаказПоставщикуМатериалы.Резерв > 0
	|	И НЕ ЗаказПоставщикуМатериалы.Ссылка.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета КАК СчетУчета,
	|	ТаблицаЗапасы.СчетУчета КАК КоррСчетУчета,
	|	ТаблицаЗапасы.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасы.Номенклатура КАК КоррНоменклатура,
	|	ТаблицаЗапасы.Характеристика КАК Характеристика,
	|	ТаблицаЗапасы.Характеристика КАК КоррХарактеристика,
	|	ТаблицаЗапасы.Партия КАК Партия,
	|	ТаблицаЗапасы.Партия КАК КоррПартия,
	|	ТаблицаЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий КАК ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СодержаниеПроводки КАК СодержаниеПроводки,
	|	СУММА(ТаблицаЗапасы.Количество) КАК Количество,
	|	СУММА(ТаблицаЗапасы.Сумма) КАК Сумма,
	|	ЛОЖЬ КАК ФиксированнаяСтоимость
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия,
	|	ТаблицаЗапасы.ЗаказПокупателя,
	|	ТаблицаЗапасы.КоррЗаказПокупателя,
	|	ТаблицаЗапасы.СодержаниеПроводки,
	|	ТаблицаЗапасы.ВидДвиженияУправленческий,
	|	ТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ТаблицаЗапасы.СчетУчета,
	|	ТаблицаЗапасы.Номенклатура,
	|	ТаблицаЗапасы.Характеристика,
	|	ТаблицаЗапасы.Партия";
	
	// +++ Инфостарт #2666 02.08.2021 Добавление движений по регистру резервов
	Если ЗначениеЗаполнено(ДокументСсылкаЗаказПоставщику.дм_НомерЗаказНаряда)
			И ЗначениеЗаполнено(ДокументСсылкаЗаказПоставщику.дм_ДатаЗаказНаряда)
			И ДокументСсылкаЗаказПоставщику.дмЗаказНаДавальческоеСырье Тогда
		
		// +++ Инфостарт 16.08.2021 Резервирование без разреза складов (для чужих складов)
		ЗапросСклада = Новый Запрос;
		ЗапросСклада.Текст =
		"ВЫБРАТЬ
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья КАК Склад,
		//{[+] Инфостарт А.Васильев 08.02.2022 #
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладСММ КАК СкладСММ
		//} Инфостарт А.Васильев 08.02.2022
		|ИЗ
		|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
		|ГДЕ
		|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.Подразделение = &Подразделение";
		
		ЗапросСклада.УстановитьПараметр("Подразделение", ДокументСсылкаЗаказПоставщику.СтруктурнаяЕдиница);
		
		РезультатЗапросаСклада = ЗапросСклада.Выполнить();
		
		Если РезультатЗапросаСклада.Пустой() Тогда
			Запрос.УстановитьПараметр("СкладРезерва", Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
			//{[+] Инфостарт А.Васильев 08.02.2022 #
			Запрос.УстановитьПараметр("СкладСММ", Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
			//} Инфостарт А.Васильев 08.02.2022
		Иначе
			//{[+] Инфостарт А.Васильев 08.02.2022 #
			ВыборкаЗапросаСклада = РезультатЗапросаСклада.Выбрать();
			ВыборкаЗапросаСклада.Следующий();
			Запрос.УстановитьПараметр("СкладСММ", ВыборкаЗапросаСклада.СкладСММ);
			//} Инфостарт А.Васильев 08.02.2022
			Запрос.УстановитьПараметр("СкладРезерва", ДокументСсылкаЗаказПоставщику.дмСкладХраненияЗапасов);
		КонецЕсли;
		// --- Инфостарт 16.08.2021
		
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Период КАК Период,
		|	ВложенныйЗапрос.ВидДвижения КАК ВидДвижения,
		|	ВложенныйЗапрос.Регистратор КАК Регистратор,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВложенныйЗапрос.асЗаказНаряд КАК асЗаказНаряд,
		|	ВложенныйЗапрос.Количество КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		RMS_РезервыПодЗаказНаряд.Период КАК Период,
		|		RMS_РезервыПодЗаказНаряд.ВидДвижения КАК ВидДвижения,
		|		RMS_РезервыПодЗаказНаряд.Регистратор КАК Регистратор,
		|		RMS_РезервыПодЗаказНаряд.Организация КАК Организация,
		|		RMS_РезервыПодЗаказНаряд.Номенклатура КАК Номенклатура,
		|		RMS_РезервыПодЗаказНаряд.Характеристика КАК Характеристика,
		|		RMS_РезервыПодЗаказНаряд.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|		RMS_РезервыПодЗаказНаряд.асЗаказНаряд КАК асЗаказНаряд,
		|		RMS_РезервыПодЗаказНаряд.Количество КАК Количество
		|	ИЗ
		|		РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК RMS_РезервыПодЗаказНаряд
		|	ГДЕ
		|		RMS_РезервыПодЗаказНаряд.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВложенныйЗапрос.Регистратор.Дата,
		|		ВЫБОР
		|			КОГДА ВложенныйЗапрос.Количество > 0
		|				ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|		КОНЕЦ,
		|		ВложенныйЗапрос.Регистратор,
		|		ВложенныйЗапрос.Организация,
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.Характеристика,
		|		ВложенныйЗапрос.СтруктурнаяЕдиница,
		|		ВложенныйЗапрос.асЗаказНаряд,
		|		ВЫБОР
		|			КОГДА ВложенныйЗапрос.Количество > 0
		|				ТОГДА ВложенныйЗапрос.Количество
		|			ИНАЧЕ -1 * ВложенныйЗапрос.Количество
		|		КОНЕЦ
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВложенныйЗапрос.Регистратор КАК Регистратор,
		|			ВложенныйЗапрос.Организация КАК Организация,
		|			ВложенныйЗапрос.асЗаказНаряд КАК асЗаказНаряд,
		|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|			ВложенныйЗапрос.Характеристика КАК Характеристика,
		|			ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|			СУММА(ВложенныйЗапрос.Количество) КАК Количество
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ЗаказПоставщикуЗапасы.Ссылка КАК Регистратор,
		|				асЗаказНаряд.Организация КАК Организация,
		|				асЗаказНаряд.Ссылка КАК асЗаказНаряд,
		|				ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
		|				ЗаказПоставщикуЗапасы.Характеристика КАК Характеристика,
		// +++ Инфостарт 16.08.2021 Резервирование  без разреза складов (для чужих складов)
		//// +++ Инфостарт 04.08.2021
		////|				асЗаказНаряд.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		//|				ЗаказПоставщикуЗапасы.Ссылка.дмСкладХраненияЗапасов КАК СтруктурнаяЕдиница,
		//// --- Инфостарт 04.08.2021
		//{[*] Инфостарт А.Васильев 08.02.2022 #
		//|				ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|				&СкладСММ КАК СтруктурнаяЕдиница, 
		//} Инфостарт А.Васильев 08.02.2022
		// --- Инфостарт 16.08.2021
		// +++ Инфостарт 09.08.2021
		//|				ЗаказПоставщикуЗапасы.Количество - ЗаказПоставщикуЗапасы.дмКоличествоОтгружено КАК Количество
		|				ЗаказПоставщикуЗапасы.Количество КАК Количество
		// --- Инфостарт 09.08.2021
		|			ИЗ
		|				Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.асЗаказНаряд КАК асЗаказНаряд
		|					ПО ЗаказПоставщикуЗапасы.Ссылка.дм_НомерЗаказНаряда = асЗаказНаряд.Номер
		// +++ Инфостарт 30.08.2021 Доработка условия по дате
		//|						И ЗаказПоставщикуЗапасы.Ссылка.дм_ДатаЗаказНаряда = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ДЕНЬ)
		|						И НАЧАЛОПЕРИОДА(ЗаказПоставщикуЗапасы.Ссылка.дм_ДатаЗаказНаряда, ГОД) = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ГОД)
		// --- Инфостарт 30.08.2021
		|			ГДЕ
		|				ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
		|				И ЗаказПоставщикуЗапасы.дмРезервировать = ИСТИНА
		// +++ Инфостарт #3886 02.09.2021
		|				И ЗаказПоставщикуЗапасы.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
		// --- Инфостарт #3886 02.09.2021
		|			
		// +++ Инфостарт 16.08.2021 Резервирование  без разреза складов (для чужих складов)
		// Для своих складов создаем 2 записи - одну с пустым складом, второю с заполненным, своим
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ЗаказПоставщикуЗапасы.Ссылка,
		|				асЗаказНаряд.Организация,
		|				асЗаказНаряд.Ссылка,
		|				ЗаказПоставщикуЗапасы.Номенклатура,
		|				ЗаказПоставщикуЗапасы.Характеристика,
		|				&СкладРезерва,
		|				ЗаказПоставщикуЗапасы.Количество
		|			ИЗ
		|				Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.асЗаказНаряд КАК асЗаказНаряд
		|					ПО ЗаказПоставщикуЗапасы.Ссылка.дм_НомерЗаказНаряда = асЗаказНаряд.Номер
		// +++ Инфостарт 30.08.2021 Доработка условия по дате
		//|						И ЗаказПоставщикуЗапасы.Ссылка.дм_ДатаЗаказНаряда = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ДЕНЬ)
		|						И НАЧАЛОПЕРИОДА(ЗаказПоставщикуЗапасы.Ссылка.дм_ДатаЗаказНаряда, ГОД) = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ГОД)
		// --- Инфостарт 30.08.2021
		|			ГДЕ
		|				ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
		|				И ЗаказПоставщикуЗапасы.дмРезервировать = ИСТИНА
		|				И &СкладРезерва <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		// +++ Инфостарт #3886 02.09.2021
		|				И ЗаказПоставщикуЗапасы.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ
		// --- Инфостарт #3886 02.09.2021
		|			
		// --- Инфостарт 16.08.2021
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				RMS_РезервыПодЗаказНаряд.Регистратор,
		|				RMS_РезервыПодЗаказНаряд.Организация,
		|				RMS_РезервыПодЗаказНаряд.асЗаказНаряд,
		|				RMS_РезервыПодЗаказНаряд.Номенклатура,
		|				RMS_РезервыПодЗаказНаряд.Характеристика,
		|				RMS_РезервыПодЗаказНаряд.СтруктурнаяЕдиница,
		|				ВЫБОР
		|					КОГДА RMS_РезервыПодЗаказНаряд.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА -1 * RMS_РезервыПодЗаказНаряд.Количество
		|					ИНАЧЕ RMS_РезервыПодЗаказНаряд.Количество
		|				КОНЕЦ
		|			ИЗ
		|				РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК RMS_РезервыПодЗаказНаряд
		|			ГДЕ
		|				RMS_РезервыПодЗаказНаряд.Регистратор = &Ссылка) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Регистратор,
		|			ВложенныйЗапрос.Организация,
		|			ВложенныйЗапрос.асЗаказНаряд,
		|			ВложенныйЗапрос.Номенклатура,
		|			ВложенныйЗапрос.Характеристика,
		|			ВложенныйЗапрос.СтруктурнаяЕдиница) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Количество <> 0";
		
	КонецЕсли;
	// --- Инфостарт #2666 02.08.2021
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказПоставщику);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьПартии",  СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	Запрос.УстановитьПараметр("РезервированиеЗапасов", НСтр("ru = 'Резервирование запасов'"));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПоставщикам", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПотребностьВЗапасах", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГрафикДвиженияЗапасов", МассивРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРазмещениеЗаказов", МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[5].Выгрузить());
	
	// +++ Инфостарт #2666 02.08.2021 Добавление движений по регистру резервов
	Если ЗначениеЗаполнено(ДокументСсылкаЗаказПоставщику.дм_НомерЗаказНаряда)
			И ЗначениеЗаполнено(ДокументСсылкаЗаказПоставщику.дм_ДатаЗаказНаряда)
			И ДокументСсылкаЗаказПоставщику.дмЗаказНаДавальческоеСырье Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПодЗаказНарядКарсервис", МассивРезультатов[6].Выгрузить());
	КонецЕсли;
	// --- Инфостарт #2666 02.08.2021
	
	СформироватьТаблицаЗапасы(ДокументСсылкаЗаказПоставщику, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылкаЗаказПоставщику, СтруктураДополнительныеСвойства);
	СформироватьТаблицаОплатаСчетовИЗаказов(ДокументСсылкаЗаказПоставщику, СтруктураДополнительныеСвойства);
	
	
КонецПроцедуры
