// +++ Инфостарт 09.08.2021
Процедура СформироватьТаблицаРезервы(ДокументСсылкаПеремещениеЗапасов, СтруктураДополнительныеСвойства)
	
	// +++ Инфостарт #2507 23.08.2021 
	Если ДокументСсылкаПеремещениеЗапасов.дмОтгрузкаНаСобственныеСклады Тогда
		
		ЗапросЗаказНарядов = Новый Запрос;
		ЗапросЗаказНарядов.Текст =
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Ссылка.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	МАКСИМУМ(ПеремещениеЗапасовЗапасы.Количество) КАК Количество,
		|	ЕСТЬNULL(асЗаказНаряд.Ссылка, ЗНАЧЕНИЕ(документ.асЗаказНаряд.ПустаяСсылка)) КАК ЗаказНаряд
		|ПОМЕСТИТЬ ВТ_ЗаказНаряды
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.дмЗаказыПоставщику КАК ПеремещениеЗапасовдмЗаказыПоставщику
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.асЗаказНаряд КАК асЗаказНаряд
		|			ПО ПеремещениеЗапасовдмЗаказыПоставщику.Документ.дм_НомерЗаказНаряда = асЗаказНаряд.Номер
		// +++ Инфостарт 30.08.2021 Доработка условия по дате
		//|				И (ПеремещениеЗапасовдмЗаказыПоставщику.Документ.дм_ДатаЗаказНаряда = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ДЕНЬ))
		|				И (НАЧАЛОПЕРИОДА(ПеремещениеЗапасовдмЗаказыПоставщику.Документ.дм_ДатаЗаказНаряда, ГОД) = НАЧАЛОПЕРИОДА(асЗаказНаряд.Дата, ГОД))
		// --- Инфостарт 30.08.2021
		|		ПО ПеремещениеЗапасовЗапасы.дмУИСтроки = ПеремещениеЗапасовдмЗаказыПоставщику.УИСтрокиЗапаса
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|	И ЕСТЬNULL(асЗаказНаряд.Ссылка, ЗНАЧЕНИЕ(Документ.асЗаказНаряд.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.асЗаказНаряд.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Ссылка.Организация,
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ЕСТЬNULL(асЗаказНаряд.Ссылка, ЗНАЧЕНИЕ(документ.асЗаказНаряд.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказНаряды.Организация КАК Организация,
		|	ВТ_ЗаказНаряды.ЗаказНаряд КАК асЗаказНаряд,
		|	ВТ_ЗаказНаряды.Номенклатура КАК Номенклатура,
		|	ВТ_ЗаказНаряды.Характеристика КАК Характеристика,
		|	ВТ_ЗаказНаряды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ЕСТЬNULL(Ост.КоличествоОстаток, 0) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиРезервов
		|ИЗ
		|	ВТ_ЗаказНаряды КАК ВТ_ЗаказНаряды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
		|				,
		|				асЗаказНаряд В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказНаряды.ЗаказНаряд
		|					ИЗ
		|						ВТ_ЗаказНаряды КАК ВТ_ЗаказНаряды)) КАК Ост
		|		ПО ВТ_ЗаказНаряды.ЗаказНаряд = Ост.асЗаказНаряд
		|			И ВТ_ЗаказНаряды.СтруктурнаяЕдиница = Ост.СтруктурнаяЕдиница
		|			И ВТ_ЗаказНаряды.Номенклатура = Ост.Номенклатура
		|			И ВТ_ЗаказНаряды.Характеристика = Ост.Характеристика
		|			И ВТ_ЗаказНаряды.Организация = Ост.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	RMS_РезервыПодЗаказНаряд.Организация,
		|	RMS_РезервыПодЗаказНаряд.асЗаказНаряд,
		|	RMS_РезервыПодЗаказНаряд.Номенклатура,
		|	RMS_РезервыПодЗаказНаряд.Характеристика,
		|	RMS_РезервыПодЗаказНаряд.СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА RMS_РезервыПодЗаказНаряд.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА -1 * RMS_РезервыПодЗаказНаряд.Количество
		|		ИНАЧЕ RMS_РезервыПодЗаказНаряд.Количество
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК RMS_РезервыПодЗаказНаряд
		|ГДЕ
		|	RMS_РезервыПодЗаказНаряд.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиРезервов.Организация КАК Организация,
		|	ВТ_ОстаткиРезервов.асЗаказНаряд КАК асЗаказНаряд,
		|	ВТ_ОстаткиРезервов.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиРезервов.Характеристика КАК Характеристика,
		|	ВТ_ОстаткиРезервов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	СУММА(ВТ_ОстаткиРезервов.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиРезервовГруп
		|ИЗ
		|	ВТ_ОстаткиРезервов КАК ВТ_ОстаткиРезервов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОстаткиРезервов.Номенклатура,
		|	ВТ_ОстаткиРезервов.Характеристика,
		|	ВТ_ОстаткиРезервов.СтруктурнаяЕдиница,
		|	ВТ_ОстаткиРезервов.Организация,
		|	ВТ_ОстаткиРезервов.асЗаказНаряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказНаряды.Организация КАК Организация,
		|	ВТ_ЗаказНаряды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТ_ЗаказНаряды.Номенклатура КАК Номенклатура,
		|	ВТ_ЗаказНаряды.Характеристика КАК Характеристика,
		|	ВТ_ЗаказНаряды.ЗаказНаряд КАК ЗаказНаряд,
		|	ВТ_ЗаказНаряды.Количество КАК КоличествоКСписанию,
		|	ЕСТЬNULL(ВТ_ОстаткиРезервовГруп.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	0 КАК Количество
		|ИЗ
		|	ВТ_ЗаказНаряды КАК ВТ_ЗаказНаряды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиРезервовГруп КАК ВТ_ОстаткиРезервовГруп
		|		ПО ВТ_ЗаказНаряды.Организация = ВТ_ОстаткиРезервовГруп.Организация
		|			И ВТ_ЗаказНаряды.СтруктурнаяЕдиница = ВТ_ОстаткиРезервовГруп.СтруктурнаяЕдиница
		|			И ВТ_ЗаказНаряды.Номенклатура = ВТ_ОстаткиРезервовГруп.Номенклатура
		|			И ВТ_ЗаказНаряды.Характеристика = ВТ_ОстаткиРезервовГруп.Характеристика
		|			И ВТ_ЗаказНаряды.ЗаказНаряд = ВТ_ОстаткиРезервовГруп.асЗаказНаряд
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаряд.Дата
		|ИТОГИ
		|	МАКСИМУМ(КоличествоКСписанию)
		|ПО
		|	Организация,
		|	СтруктурнаяЕдиница,
		|	Номенклатура,
		|	Характеристика";
		
		ЗапросЗаказНарядов.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
		РезультатЗапроса = ЗапросЗаказНарядов.Выполнить();
		
		ТаблицаДвижений = РезультатЗапроса.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		ВыборкаОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОрганизации.Следующий() Цикл
			
			ВыборкаСклад = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСклад.Следующий() Цикл
				
				ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаХарактеристика.Следующий() Цикл
						
						ОсталосьРаспределить = ВыборкаХарактеристика.КоличествоКСписанию;
						
						ВыборкаЗН = ВыборкаХарактеристика.Выбрать();
						
						Пока ВыборкаЗН.Следующий() И ОсталосьРаспределить > 0 Цикл
							
							Если ОсталосьРаспределить >= ВыборкаЗН.КоличествоОстаток Тогда
								
								СтрокаДвижений = ТаблицаДвижений.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаДвижений, ВыборкаЗН);
								СтрокаДвижений.Количество = ВыборкаЗН.КоличествоОстаток;
								
								ОсталосьРаспределить = ОсталосьРаспределить - ВыборкаЗН.КоличествоОстаток;
								
							ИначеЕсли ОсталосьРаспределить < ВыборкаЗН.КоличествоОстаток И ОсталосьРаспределить > 0 Тогда
								
								СтрокаДвижений = ТаблицаДвижений.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаДвижений, ВыборкаЗН);
								СтрокаДвижений.Количество = ОсталосьРаспределить;
								
								ОсталосьРаспределить = 0;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаДвижений", ТаблицаДвижений);
		Запрос.УстановитьПараметр("ДатаДокумента",   ДокументСсылкаПеремещениеЗапасов.Дата);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&ДатаДокумента КАК Период,
		|	ТаблицаДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаДвижений.Организация КАК Организация,
		|	ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ТаблицаДвижений.ЗаказНаряд КАК асЗаказНаряд,
		|	ТаблицаДвижений.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ДанныеДокПер
		|ИЗ
		|	&ТаблицаДвижений КАК ТаблицаДвижений"
		
	Иначе
	// --- Инфостарт #2507 23.08.2021
		
		Запрос = Новый Запрос;
		
		// +++ Инфостарт Васильев А.Э. 08.11.2021
		// #5620 Перенос механизма аналогов номенклатуры из СММ
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаПеремещениеЗапасов, "ДокументОснование");
		Если ПолучитьФункциональнуюОпцию("дмИспользоватьАналоги") 
			И ЗначениеЗаполнено(ДокументОснование) 
			И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.асЗаказНаряд") Тогда
			
			Запрос.Текст = 
			//{[+] Инфостарт А.Васильев 04.02.2022 #упс
			//"ВЫБРАТЬ
			//|	Запасы.НомерСтроки КАК НомерСтроки,
			//|	Запасы.Номенклатура КАК Номенклатура,
			//|	АналогиНоменклатуры.Номенклатура КАК НоменклатураОригинал
			//|ПОМЕСТИТЬ АналогиПеремещения
			//|ИЗ
			//|	Документ.ПеремещениеЗапасов.Запасы КАК Запасы
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
			//|		ПО Запасы.Номенклатура = АналогиНоменклатуры.Аналог
			//|ГДЕ
			//|	Запасы.Ссылка = &Ссылка
			//|	И Запасы.Номенклатура.дмЭтоАналог
			//|;

			"ВЫБРАТЬ
			|	Запасы.НомерСтроки КАК НомерСтроки,
			|	Запасы.Номенклатура КАК Номенклатура,
			|	МИНИМУМ(ЕСТЬNULL(АналогиНоменклатуры.Номенклатура, Запасы.Номенклатура)) КАК НоменклатураОригинал
			|ПОМЕСТИТЬ АналогиПеремещения
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК Запасы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
			|		ПО (Запасы.Номенклатура = АналогиНоменклатуры.Аналог)
			|ГДЕ
			|	Запасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	Запасы.НомерСтроки,
			|	Запасы.Номенклатура
			|;
			//} Инфостарт А.Васильев 04.02.2022
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбъединеннаяТаблица.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ НоменклатураЗаказНаряда
			|ИЗ
			|	(ВЫБРАТЬ
			|		Запасы.Номенклатура КАК Номенклатура
			|	ИЗ
			|		Документ.асЗаказНаряд.Запасы КАК Запасы
			|	ГДЕ
			|		Запасы.Ссылка = &ДокументОснование
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		Материалы.Номенклатура
			|	ИЗ
			|		Документ.асЗаказНаряд.Материалы КАК Материалы
			|	ГДЕ
			|		Материалы.Ссылка = &ДокументОснование
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		МатериалыЗаказчика.Номенклатура
			|	ИЗ
			|		Документ.асЗаказНаряд.МатериалыЗаказчика КАК МатериалыЗаказчика
			|	ГДЕ
			|		МатериалыЗаказчика.Ссылка = &ДокументОснование) КАК ОбъединеннаяТаблица
			|
			|СГРУППИРОВАТЬ ПО
			|	ОбъединеннаяТаблица.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	АналогиПеремещения.НомерСтроки КАК НомерСтроки,
			|	АналогиПеремещения.Номенклатура КАК НоменклатураАналог,
			|	НоменклатураЗаказНаряда.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ НайденныеОригиналы
			|ИЗ
			|	АналогиПеремещения КАК АналогиПеремещения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураЗаказНаряда КАК НоменклатураЗаказНаряда
			|		ПО АналогиПеремещения.НоменклатураОригинал = НоменклатураЗаказНаряда.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
			|	ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница КАК итсСтруктурнаяЕдиница,
			|	МАКСИМУМ(НайденныеОригиналы.Номенклатура) КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ПеремещениеЗапасовЗапасы.дмУИСтроки КАК дмУИСтроки,
			|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
			|	НайденныеОригиналы.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ ТаблицаЗапасыПеремещение
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НайденныеОригиналы КАК НайденныеОригиналы
			|		ПО ПеремещениеЗапасовЗапасы.НомерСтроки = НайденныеОригиналы.НомерСтроки
			|			И ПеремещениеЗапасовЗапасы.Номенклатура = НайденныеОригиналы.НоменклатураАналог
			|ГДЕ
			|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПеремещениеЗапасовЗапасы.Ссылка,
			|	ПеремещениеЗапасовЗапасы.дмУИСтроки,
			|	ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница,
			|	ПеремещениеЗапасовЗапасы.Количество,
			|	НайденныеОригиналы.НомерСтроки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПеремещениеЗапасовЗапасы.Ссылка,
			|	ПеремещениеЗапасовЗапасы.итсСтруктурнаяЕдиница,
			|	ПеремещениеЗапасовЗапасы.Номенклатура,
			|	ПеремещениеЗапасовЗапасы.Характеристика,
			|	ПеремещениеЗапасовЗапасы.дмУИСтроки,
			|	ПеремещениеЗапасовЗапасы.Количество,
			|	ПеремещениеЗапасовЗапасы.НомерСтроки
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
			|ГДЕ
			|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
			|	И НЕ ПеремещениеЗапасовЗапасы.Номенклатура.дмЭтоАналог
			|	И ПеремещениеЗапасовЗапасы.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Запасы.Ссылка КАК Ссылка,
			|	Запасы.итсСтруктурнаяЕдиница КАК итсСтруктурнаяЕдиница,
			|	Запасы.Номенклатура КАК Номенклатура,
			|	Запасы.Характеристика КАК Характеристика,
			|	Запасы.дмУИСтроки КАК дмУИСтроки,
			|	Запасы.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаЗапасыПеремещение 	
			|ИЗ
			|	Документ.ПеремещениеЗапасов.Запасы КАК Запасы
			|
			|ГДЕ
			|	Запасы.Ссылка = &Ссылка
			|	И Запасы.Номенклатура.дмНеУчаствуетВРезервах = ЛОЖЬ";
			
		КонецЕсли;
		
		
		//Запрос.Текст =
		//"ВЫБРАТЬ
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		// --- Инфостарт Васильев А.Э. 08.11.2021
		|	Запасы.Ссылка.Дата КАК Период,
		// +++ Инфостарт 17.08.2021 Резервирование без разреза складов (для чужих складов)
		//|	Запасы.итсСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА Запасы.итсСтруктурнаяЕдиница В (&МассивСкладов)
		|			ТОГДА Запасы.итсСтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.структурныеЕдиницы.ПустаяСсылка)
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		// --- Инфостарт 17.08.2021
		|	Запасы.Ссылка.Организация КАК Организация,
		|	Запасы.Номенклатура КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		// +++ Инфостарт #2507 23.08.2021
		//|	ВЫРАЗИТЬ(Запасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд) КАК асЗаказНаряд,
		|	&ЗаказНаряд КАК асЗаказНаряд,
		// --- Инфостарт #2507 23.08.2021
		|	СУММА(Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ДанныеДокПер
		|ИЗ
		// +++ Инфостарт Васильев А.Э. 08.11.2021
		// #5620 Перенос механизма аналогов номенклатуры из СММ
		//|	Документ.ПеремещениеЗапасов.Запасы КАК Запасы
		|	ТаблицаЗапасыПеремещение КАК Запасы
		// --- Инфостарт Васильев А.Э. 08.11.2021	
		|ГДЕ
		|	Запасы.Ссылка = &Ссылка
		|	И (ВЫРАЗИТЬ(Запасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд)) <> ЗНАЧЕНИЕ(Документ.асЗаказНаряд.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Запасы.итсСтруктурнаяЕдиница В (&МассивСкладов)
		|			ТОГДА Запасы.итсСтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.структурныеЕдиницы.ПустаяСсылка)
		|	КОНЕЦ,
		|	Запасы.Характеристика,
		|	Запасы.Номенклатура,
		|	Запасы.Ссылка.Организация,
	// +++ Инфостарт #2507 23.08.2021
		//|	ВЫРАЗИТЬ(Запасы.Ссылка.ДокументОснование КАК Документ.асЗаказНаряд),
		//|	Запасы.Ссылка.Дата
		|	Запасы.Ссылка.Дата";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	// --- Инфостарт #2507 23.08.2021
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	ВТ_ДанныеДок.Организация КАК Организация,
	|	ВТ_ДанныеДок.асЗаказНаряд КАК асЗаказНаряд,
	|	ВТ_ДанныеДок.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеДок.Характеристика КАК Характеристика,
	|	ВТ_ДанныеДок.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	-1 * ВТ_ДанныеДок.Количество КАК Количество,
	|	ЕСТЬNULL(Ост.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_РазницаРезервы
	|ИЗ
	|	ВТ_ДанныеДокПер КАК ВТ_ДанныеДок
	// +++ Инфостарт #2507 23.08.2021
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(, асЗаказНаряд = &ЗаказНаряд) КАК Ост
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(
	|				,
	|				асЗаказНаряд В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДокПер.асЗаказНаряд
	|					ИЗ
	|						ВТ_ДанныеДокПер КАК ВТ_ДанныеДокПер)) КАК Ост
	// --- Инфостарт #2507 23.08.2021
	|		ПО ВТ_ДанныеДок.асЗаказНаряд = Ост.асЗаказНаряд
	|			И ВТ_ДанныеДок.СтруктурнаяЕдиница = Ост.СтруктурнаяЕдиница
	|			И ВТ_ДанныеДок.Номенклатура = Ост.Номенклатура
	|			И ВТ_ДанныеДок.Характеристика = Ост.Характеристика
	|			И ВТ_ДанныеДок.Организация = Ост.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	RMS_РезервыПодЗаказНаряд.Регистратор,
	|	RMS_РезервыПодЗаказНаряд.Организация,
	|	RMS_РезервыПодЗаказНаряд.асЗаказНаряд,
	|	RMS_РезервыПодЗаказНаряд.Номенклатура,
	|	RMS_РезервыПодЗаказНаряд.Характеристика,
	|	RMS_РезервыПодЗаказНаряд.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА RMS_РезервыПодЗаказНаряд.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1 * RMS_РезервыПодЗаказНаряд.Количество
	|		ИНАЧЕ RMS_РезервыПодЗаказНаряд.Количество
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК RMS_РезервыПодЗаказНаряд
	|ГДЕ
	|	RMS_РезервыПодЗаказНаряд.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазницаРезервы.Регистратор КАК Регистратор,
	|	ВТ_РазницаРезервы.Организация КАК Организация,
	|	ВТ_РазницаРезервы.асЗаказНаряд КАК асЗаказНаряд,
	|	ВТ_РазницаРезервы.Номенклатура КАК Номенклатура,
	|	ВТ_РазницаРезервы.Характеристика КАК Характеристика,
	|	ВТ_РазницаРезервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ВТ_РазницаРезервы.Количество) КАК Количество
	// +++ Инфостарт #2666 12.08.2021
	|	,МАКСИМУМ(ВТ_РазницаРезервы.КоличествоОстаток) КАК ОстатокНаСкладе
	// --- Инфостарт #2666 12.08.2021
	|ПОМЕСТИТЬ ВТ_РазницаРезервыГруп
	|ИЗ
	|	ВТ_РазницаРезервы КАК ВТ_РазницаРезервы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РазницаРезервы.Регистратор,
	|	ВТ_РазницаРезервы.Организация,
	|	ВТ_РазницаРезервы.асЗаказНаряд,
	|	ВТ_РазницаРезервы.Номенклатура,
	|	ВТ_РазницаРезервы.Характеристика,
	|	ВТ_РазницаРезервы.СтруктурнаяЕдиница
	|
	// +++ Инфостарт #2666 12.08.2021
	//|ИМЕЮЩИЕ
	//|	МАКСИМУМ(ВТ_РазницаРезервы.КоличествоОстаток) >= -1 * СУММА(ВТ_РазницаРезервы.Количество)
	// --- Инфостарт #2666 12.08.2021
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	RMS_РезервыПодЗаказНаряд.Период КАК Период,
	|	RMS_РезервыПодЗаказНаряд.ВидДвижения КАК ВидДвижения,
	|	RMS_РезервыПодЗаказНаряд.Регистратор КАК Регистратор,
	|	RMS_РезервыПодЗаказНаряд.Организация КАК Организация,
	|	RMS_РезервыПодЗаказНаряд.Номенклатура КАК Номенклатура,
	|	RMS_РезервыПодЗаказНаряд.Характеристика КАК Характеристика,
	|	RMS_РезервыПодЗаказНаряд.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	RMS_РезервыПодЗаказНаряд.асЗаказНаряд КАК асЗаказНаряд,
	|	RMS_РезервыПодЗаказНаряд.Количество КАК Количество
	// +++ Инфостарт #2666 12.08.2021
	|	, ЛОЖЬ КАК НедостатокНаСкладе
	// --- Инфостарт #2666 12.08.2021
	|ПОМЕСТИТЬ ВТ_ВсеРезервы
	|ИЗ
	|	РегистрНакопления.RMS_РезервыПодЗаказНаряд КАК RMS_РезервыПодЗаказНаряд
	|ГДЕ
	|	RMS_РезервыПодЗаказНаряд.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РазницаРезервыГруп.Регистратор.Дата,
	|	ВЫБОР
	|		КОГДА ВТ_РазницаРезервыГруп.Количество > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	ВТ_РазницаРезервыГруп.Регистратор,
	|	ВТ_РазницаРезервыГруп.Организация,
	|	ВТ_РазницаРезервыГруп.Номенклатура,
	|	ВТ_РазницаРезервыГруп.Характеристика,
	|	ВТ_РазницаРезервыГруп.СтруктурнаяЕдиница,
	|	ВТ_РазницаРезервыГруп.асЗаказНаряд,
	|	ВЫБОР
	|		КОГДА ВТ_РазницаРезервыГруп.Количество > 0
	|			ТОГДА ВТ_РазницаРезервыГруп.Количество
	// +++ Инфостарт 17.08.2021 Если на складе недостаточно товара, то спишем доступный остаток
	|		КОГДА (-1 * ВТ_РазницаРезервыГруп.Количество) > ВТ_РазницаРезервыГруп.ОстатокНаСкладе И ВТ_РазницаРезервыГруп.Количество < 0
	|			ТОГДА ВТ_РазницаРезервыГруп.ОстатокНаСкладе
	// --- Инфостарт 17.08.2021
	|		ИНАЧЕ -1 * ВТ_РазницаРезервыГруп.Количество
	|	КОНЕЦ
	// +++ Инфостарт #2666 12.08.2021
	|	, ВЫБОР
	|		КОГДА (-1 * ВТ_РазницаРезервыГруп.Количество) > ВТ_РазницаРезервыГруп.ОстатокНаСкладе И ВТ_РазницаРезервыГруп.Количество < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НедостатокНаСкладе
	// --- Инфостарт #2666 12.08.2021
	|ИЗ
	|	ВТ_РазницаРезервыГруп КАК ВТ_РазницаРезервыГруп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеРезервы.Период КАК Период,
	|	ВТ_ВсеРезервы.ВидДвижения КАК ВидДвижения,
	|	ВТ_ВсеРезервы.Регистратор КАК Регистратор,
	|	ВТ_ВсеРезервы.Организация КАК Организация,
	|	ВТ_ВсеРезервы.Номенклатура КАК Номенклатура,
	|	ВТ_ВсеРезервы.Характеристика КАК Характеристика,
	|	ВТ_ВсеРезервы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_ВсеРезервы.асЗаказНаряд КАК асЗаказНаряд,
	|	ВТ_ВсеРезервы.Количество КАК Количество
	// +++ Инфостарт #2666 12.08.2021
	|	, ВТ_ВсеРезервы.НедостатокНаСкладе КАК НедостатокНаСкладе
	// --- Инфостарт #2666 12.08.2021
	|ИЗ
	|	ВТ_ВсеРезервы КАК ВТ_ВсеРезервы
	|ГДЕ
	|	ВТ_ВсеРезервы.Количество <> 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеЗапасов);
	
	// +++ Инфостарт #2507 23.08.2021
	//Запрос.УстановитьПараметр("ЗаказНаряд", ДокументСсылкаПеремещениеЗапасов.ДокументОснование);
	Если ТипЗнч(ДокументСсылкаПеремещениеЗапасов.ДокументОснование) = Тип("ДокументСсылка.асЗаказНаряд") Тогда
		Запрос.УстановитьПараметр("ЗаказНаряд", ДокументСсылкаПеремещениеЗапасов.ДокументОснование);
	Иначе
		Запрос.УстановитьПараметр("ЗаказНаряд", Документы.асЗаказНаряд.ПустаяСсылка());
	КонецЕсли;
	// --- Инфостарт #2507 23.08.2021
	
	// +++ Инфостарт 17.08.2021 Резервирование без разреза складов (для чужих складов)
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст =
	"ВЫБРАТЬ
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья КАК Склад
	|ИЗ
	|	РегистрСведений.дмСкладыДавальческогоСырьяПоПодразделениямКрш КАК дмСкладыДавальческогоСырьяПоПодразделениямКрш
	|
	|СГРУППИРОВАТЬ ПО
	|	дмСкладыДавальческогоСырьяПоПодразделениямКрш.СкладДавальческогоСырья";
	
	РезультатЗапросаСклада = ЗапросСклада.Выполнить();
	ВыборкаСкладов = РезультатЗапросаСклада.Выбрать();
	
	МассивСкладов = Новый Массив;
	
	Пока ВыборкаСкладов.Следующий() Цикл
		МассивСкладов.Добавить(ВыборкаСкладов.Склад);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	// --- Инфостарт 17.08.2021
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРезервы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
// --- Инфостарт 09.08.2021
