&НаСервере
Процедура дм_ПроверитьОстатокНаСкладах(ТекТовар)
	МассивСкладов = Новый СписокЗначений;
	МассивСкладов.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоКоду("00-000001"));
	МассивСкладов.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ФР-000003"));
	МассивСкладов.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ФР-000009"));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	               |			&ТекДата,
	               |			Номенклатура = &ТекТовар
	               |				И СтруктурнаяЕдиница В (&МассивСкладов)) КАК ЗапасыНаСкладахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.RMS_РезервыПодЗаказНаряд.Остатки(&ТекДата, Номенклатура = &ТекТовар) КАК RMS_РезервыПодЗаказНарядОстатки
	               |		ПО ЗапасыНаСкладахОстатки.Номенклатура = RMS_РезервыПодЗаказНарядОстатки.Номенклатура
	               |ГДЕ
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(RMS_РезервыПодЗаказНарядОстатки.КоличествоОстаток, 0) > 0";
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТекТовар", ТекТовар);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ТекСтрока = Объект.Запасы.Получить(Элементы.Запасы.ТекущаяСтрока);
		ТекСтрока.дм_НетОстатка = Истина;
	КонецЕсли;
КонецПроцедуры
